{"id":"8e81d7b7-7552-424f-8f26-b397f1a6ebc4","nodes":[{"id":"node_0","title":"Weatherizing Salem","url":"https://www.theparisreview.org/blog/2025/10/31/weatherizing-salem/?utm_source=The+Paris+Review+Newsletter&utm_campaign=85b7f01cfe-TPRMailchimp_20251031_WEEKLY&utm_medium=email&utm_term=0_35491ea532-85b7f01cfe-485313003&mc_cid=85b7f01cfe&mc_eid=8f7fccc256","cluster":0,"position":{"x":7.5173420906066895,"y":4.108417510986328},"keywords":["siding","weatherization","a too-steep roof","rafters","an attic, air-sealing"],"content_preview":"All photographs courtesy of the author. I usually tell people I dont know well that my work is roofing and siding. I also tell people this when I, correctly or incorrectly, assume they dont know what ...","content":"All photographs courtesy of the author. I usually tell people I dont know well that my work is roofing and siding. I also tell people this when I, correctly or incorrectly, assume they dont know what weatherization is. When I type out weatherization, a red line appears underneath the word, indicating that the program I use to write doesnt know what it is either. I dont explain that Im usually crawling, crouching, and squirming around an attic, air-sealing; or a knee wall, air-sealing; or in a crawl space, air-sealing. In other words, blasting spray foam in a small, gross space. Sometimes I explain that Im up on a ladderanything from a sixteen-footer to a thirty-two- and, sometimes, but rarely, a forty-footerdrilling holes into the wall between each bay, from the outside, underneath siding that has been taken off to expose the homes sheathing. Sometimes holes have to be drilled inside a houseinterior drill and blowbecause of asbestos or because theres a dormer on a third or fourth floor sticking out from a too-steep roof. Sometimes I mix up the jobs jargonstrats, rafters, studs, strapping, joists. Something like foam could mean spray foam or foam board, it all depends on the context. Im usually covered in dust, mold, and rat shit, squeezing through knee walls, attics, crawl spaces. This is all considered unskilled labor. After holes are drilled into the wall, or the attics prepped, the necessary spaces get filled with cellulose, a kind of insulation made of things like shredded newspaper. When Im cutting open the bags to load it into the blower machine (versus into the truck to transport it), I think: What history or literature is being blown into these walls? Returns that got pulped? My book? My friends books, my foes? Sometimes you can catch a few words from things like grocery-store flyersFROZEN LASAGNA MEALS 6.99. Its Salem, Massachusetts, and its October, two-sweatshirt weather now. Its estimated that two million people will visit our small city this month for history (witch trials) and haunted houses and dressing up and walking around, which can make it hard to drive back to the workshop at the end of the day. This is my fourth or fifth time working for my unclesR. and D.sweatherization company and my longest stretch working for them. I didnt plan it like this, but we have a baby coming in December and we moved back so we could have him at the same hospital where we had and lost our first son a year and a half ago. We are trying to find a way to live here but with how expensive its gotten, this is whats panned out for now. Rents higher than in New York City. You cant buy a house for less than a half mil. Ive always wanted to raise a kid in Salem. Nothing like growing up near the ocean. Driving to and from the jobsite: golden retriever chasing falling leaves in the park next to a pipe painted pink with a cartoon sea monsters face. I see a sign for BILLY SWEET CHIMNEY SWEEP and a crashed-into Dunks sign. Folks in Mass call Dunkin Dunks. Dunkin was a dumb rebrand. A guy on a motorcycle with a skeleton on it. Crowds on every corner already. Bridal party dressed like witches, one in white. Every day-business selling its parking space at night. A second bridal party. Birds or shadows of birds across the Four Points Hotel in Lynnfield. I think Lynnfield. Stuck in traffic, listening to our go-to songsHIGHJACK (right back) by AAP Rocky, or the Silver Jews cover of Friday Night Fever, or a couple of songs by this pop-punk band my buddy Aleks likes called Dear Maryanneand thinking about the job, staving off the dread of getting into the attic full of moldy sheets of faced Rockwool underneath faced fiberglass, sweating in our Tyvek suits. The better you insulate, the hotter it gets up there.  I put my time card into the machine and it stamps out 6:44. Go up to see R. and D. They tell me what crew Im on. With Aleks. I like working with Aleks. Hes got way more experience than me, so hes always showing me tips and tricks. But hes late again, so I walk around the shops yard. Theres a dozen of us, give or take, maybe six box trucks, a roofing truck, and a dump truck. A few people are sitting in the back of a couple box trucks taking inventory, staying out of the cold. Anybody standing in a group is laughing or complaining about someone they worked with last week. My uncles and the crewpairs of brothers, guys from California, Salem guystheyre all characters, theyve all got their big personalities, everyones telling a joke they just learned or retelling one theyve already told. They call me sobrino. Some bad moods, some good. Were all weaving around one another, the masonry guys we share the yard with, L in the Terex moving pallets and eating a microwaved hamburger. I help load a truck with insulation. I look for Alekss list to see what we need in the truck. We loading cellulose today? How many sheets of foam board? Cases of spray foam? Masks, Tyvek suits, trash bags? Sheetrock, lumber? Aneudy gives me a hand. Hes probab..."},{"id":"node_1","title":"The Goon Squad","url":"https://harpers.org/archive/2025/11/the-goon-squad-daniel-kolitz-porn-masturbation-loneliness/","cluster":0,"position":{"x":10.27050495147705,"y":2.9665472507476807},"keywords":["Malones death","The Goon Squad Loneliness","this particular sex crime","Malones expression","Nautica Malone"],"content_preview":"November 2025 Issue [Report] The Goon Squad Loneliness, porns next frontier, and the dream of endless masturbation by Daniel Kolitz, Illustration by Melcher Oosterman [Report] The Goon Squad Lonelines...","content":"November 2025 Issue [Report] The Goon Squad Loneliness, porns next frontier, and the dream of endless masturbation by Daniel Kolitz, Illustration by Melcher Oosterman [Report] The Goon Squad Loneliness, porns next frontier, and the dream of endless masturbation by Daniel Kolitz, Adjust Share This past January, a few dozen young men in hoodies and baggy jeans congregated outside a coffee shop in Tempe, Arizona, to mourn the death of a twenty-seven-year-old man named Nautica Malone. They arrived on foot and riding shotgun in parents cars; they carried flowers and votive candles, homemade placards and shirts printed with Malones smiling face. The café where they were gathered, Bikini Beans, was part of a chain whose baristas wear bikinis. Days earlier, Malone had pulled up to the drive-through window, nude from the waist down, a hand on his penis. The barista was already filming by the time the car reached her window. Its hard to say why this particular sex crime went viral. Maybe it was something about Malones expression: he looked confident, even sultry, like he was hoping somehow to seduce the barista. Whatever the reason, the video was soon inescapable online. The view count was still climbing when Malone drove a few towns over and shot himself in the head in the front seat of his Dodge Challenger, leaving a note to his wife and young children asking for their forgiveness. Malones death was covered widely in the tabloids and trended on social media, where it was described as the Goonicide. His vigil, meanwhile, was an ironic, livestreamed stunt that came to be known as the Gooneral. Remarkably, this languageGoonicide, Gooneralwas broadly legible to hundreds of thousands of people who engaged with it online. The implication, unmistakable, was that the verb to goon, the root of these terms, had broken containment. By the time you read this article, a full definition might be needless, but in the sincere hope that that day has yet towill neverarrive, I will provide one. Gooning is a new kind of masturbation. More precisely, a new kind of masturbation at the heart of an internet-based, pornography-obsessed, Gen Zdominated subculture every bit as defined and vibrant as the hippies or punks in their prime. The act itself resembles edgingrepeatedly bringing oneself to the point of climax without actually climaxing. But gooning is more goal-oriented and more communal. The gooner goons to reach the goonstate: a supposed zone of total ego death or bliss that some liken to advanced meditation, the attainment of which compels them to masturbate for hours, or even days, at a time. The Goonerals attendees didnt care that Malone was, from all available evidence, not a gooner at all but rather an unaffiliated, lone-wolf pervert. That hed been, in their eyes, martyred for a form of self-expression was enough to make him a cause célèbre for what was increasingly coming to feel like a movement, a homegrown zoomer Tea Party that might one day produce its own gooner congressmen, gooner news networks, extremist gooner terror attacks. The gooners first came to limited public attention by way of their gooncaves: rooms remodeled in the service of porn consumption. Youd think a person, having just built a gooncave, would take every possible measure to conceal its existence, would bulk-purchase padlocks, price high-end CCTV systems, craft detailed alibis for every hour, every minute spent alone, and would still, after all that, bolt awake in the middle of the night, heart pounding at the fear of discovery. Instead, the gooners bragged about them. They posted photos of their gooncaves to Reddit. And these photos, which circulated through the young-to-youngish internet as early as 2021, were astonishing. One of course noticed the screens, sometimes three or four of them, sometimes upwards of a dozen, each lit up with porn, but one especially noticed the gooners own erect penises, foregrounded in the frame like waggish thumbs-ups. These were porn shrines. In hindsight, they were also leading indicators of some of the very serious psychological damage the lockdowns had wrought on the world. Those early-COVID images of depopulated city streetsthese were their precise corollary. They showed you where the people went. Or where at least some of them did, likely the ones who were not exactly models of stability and robust mental health to begin with. Even so, it seemed beyond dispute that sixty years ago some of these gooners would have been fathers. Small-business owners. Dependable men in hats riding slow commuter trains, their mindscapes perfumed with thoughts of stocks, bonds, lawn care. Well, what could you do? Certain social systems had failed, certain historical trend lines had converged, and now we had these guys to deal with. No one, besides maybe Neil Postman, could have predicted the formation of an international pornography cult. But the gooners rise does, in retrospect, possess a certain inevitability. Anyone paying attention to..."},{"id":"node_2","title":"We Used to Read Things in This Country | Noah McCormack","url":"https://thebaffler.com/salvos/we-used-to-read-things-in-this-country-mccormack","cluster":2,"position":{"x":9.922035217285156,"y":4.279841423034668},"keywords":["the financial press","the Columbia University financial historian","Karl Marx","the Wall Street Journal","Marxism"],"content_preview":"Noah McCormack no. 81 November 2025 We Used to Read Things in This Country The history of literacy is the history of class  Eric Timothy Carlson Marxist bros have long been interested in the financial...","content":"Noah McCormack no. 81 November 2025 We Used to Read Things in This Country The history of literacy is the history of class  Eric Timothy Carlson Marxist bros have long been interested in the financial press. Karl Marx first turned to The Economist to help understand the failure of the revolutions of 1848, and in The Eighteenth Brumaire of Louis Bonaparte, he directed readers to that organ of the aristocracy of finance to understand what liberalism was up to. The mid-century American cartoonist Don Wright featured in one sketch a supposed Moscow newsstand selling three papers: Pravda, Izvestia, and the Wall Street Journal. This tendency went into something of an eclipse in America as the Red Scare suppressed Marxism and the New Left and the cultural turn pointed attention elsewhere. But as interest in historical materialism surged after the global financial crisis of 2008, the left rediscovered the financial press as they searched for the rational kernel within the mystical shell. At first, the Financial Times was the center of attention. As Amber ALee Frost wrote in the Columbia Journalism Review, the FT covers the world as it isa global battle not of ideas or values, but of economic and political interests. After the FT came the writings of the Columbia University financial historian and blogger Adam Tooze, with people declaring themselves Tooze bros (mostly for reading his newsletter, Chartbook, not his mammoth histories). Lately, the left has fixated on the Bloomberg podcast Odd Lots, hosted by Joe Weisenthal and Tracy Alloway, with Marxists going gaga over their interviews with figures ranging from Zohran Mamdani to the CEOs of logistics companiessubjects who are uniquely able to offer insight into the supply chain shocks during Covid and, again, with the ongoing tariff volatility. Odd Lots is engrossing, covering everything from the history and economics of firewood to the role of socialism and landlordism in New York politics. But I know this mostly by secondhand report. I cant stand listening to podcasts. Im too attached to the written word; its denser, more complex, and contains more information than the spoken word. Im part of a dying breed in that orientation, and the shift in interest from the newspaper to the blog to the podcast has left me somewhat informationally marooned among my peers. Weisenthal would understand this: a special interest of his is Walter Ong, the Jesuit scholar who, two generations ago, discussed the transition from oral culture to print culture and the transition in the television age into what he called secondary orality. The story Ong tells goes like this: for most of human history, culture was exclusively oral. Knowledge was transmitted by speech, and what could be transmitted was what could be remembered. Oral culture was aggregative rather than analyticfull of redundancy, traditionalist in disposition, and embedded in the human lifeworld, rather than allowing abstract thought. Therefore, it was conservative and traditional, against innovation and any departure from the long-established norms of agricultural life. Repetition, cliché, and formulas are essential, as in Homer with his repeated phrases such as swift ships and wine-dark sea. With writing comes precision, analytical rigor, deliberate word choices, analytic remove from life, and abstract thought. Ong writes that oral culture dominated the Middle Ages, despite the invention of writing five thousand years ago or so, and in some ways the twentieth century. With the arrival of the printing press in Europe in the 1440s, print fixed the written word in place and began to supplant orality. This gave rise to, among other developments, the novel and other modern forms of writing. Then, with the emergence of electronic media, Ong sees society regressingadvancing into a secondary orality, which brings back many qualities of the first orality (note the supposedly permanent basis of writing): its fostering of a communal sense, its concentration on the present moment, and even its use of formulas. But it is essentially a more deliberate and self-conscious orality, based permanently on the use of writing and print, which are essential for the manufacture and operation of the equipment and for its use as well. A follower of Ong, Weisenthal applies him to the current moment. The podcaster sees Trump as the first postliterate president. Ong hovers over Trump repeating Crooked Hillary and Lyin Ted, the commander in chief re-creating in a much stupider fashion swift-footed Achilles. Looking at social media, Weisenthal sees the return of oral values to dominance in the public square, like loud one-upmanship. Rather than the ideal of reasoned debate, social media sets the stage for constant jousting, rewarding those who can be viral and have memes ready in their memory, as todays Homeric formula shifts both our political and neurological landscapes. When people say things like Twitter is filled with fake news or TikTok is ruining t..."},{"id":"node_3","title":"Claude Skills are awesome, maybe a bigger deal than MCP","url":"https://simonwillison.net/2025/Oct/16/claude-skills/","cluster":4,"position":{"x":7.446761131286621,"y":2.4588747024536133},"keywords":["Claudes new document creation abilities","Claude Skills","all available skill files","specialized tasks","the slack-gif-creator skill Skills"],"content_preview":"Simon Willisons Weblog Subscribe Claude Skills are awesome, maybe a bigger deal than MCP 16th October 2025 Anthropic this morning introduced Claude Skills, a new pattern for making new abilities avail...","content":"Simon Willisons Weblog Subscribe Claude Skills are awesome, maybe a bigger deal than MCP 16th October 2025 Anthropic this morning introduced Claude Skills, a new pattern for making new abilities available to their models: Claude can now use Skills to improve how it performs specific tasks. Skills are folders that include instructions, scripts, and resources that Claude can load when needed. Claude will only access a skill when its relevant to the task at hand. When used, skills make Claude better at specialized tasks like working with Excel or following your organizations brand guidelines. Their engineering blog has a more detailed explanation. Theres also a new anthropicsskills GitHub repo. (I inadvertently preempted their announcement of this feature when I reverse engineered and wrote about it last Friday!) Skills are conceptually extremely simple: a skill is a Markdown file telling the model how to do something, optionally accompanied by extra documents and pre-written scripts that the model can run to help it accomplish the tasks described by the skill. Claudes new document creation abilities, which accompanied their new code interpreter feature in September, turned out to be entirely implemented using skills. Those are now available in Anthropics repo covering .pdf, .docx, .xlsx, and .pptx files. Theres one extra detail that makes this a feature, not just a bunch of files on disk. At the start of a session Claudes various harnesses can scan all available skill files and read a short explanation for each one from the frontmatter YAML in the Markdown file. This is very token efficient: each skill only takes up a few dozen extra tokens, with the full details only loaded in should the user request a task that the skill can help solve. Trying out the slack-gif-creator skill Skills depend on a coding environment Claude Code as a General Agent Skills compared to MCP Here come the Skills The simplicity is the point Trying out the slack-gif-creator skill Heres that metadata for an example slack-gif-creator skill that Anthropic published this morning: Toolkit for creating animated GIFs optimized for Slack, with validators for size constraints and composable animation primitives. This skill applies when users request animated GIFs or emoji animations for Slack from descriptions like make me a GIF for Slack of X doing Y. I just tried this skill out in the Claude mobile web app, against Sonnet 4.5. First I enabled the slack-gif-creator skill in the settings, then I prompted: Make me a gif for slack about how Skills are way cooler than MCPs And Claude made me this GIF. Click to play (its almost epilepsy inducing, hence the click-to-play mechanism): OK, this particular GIF is terrible, but the great thing about skills is that theyre very easy to iterate on to make them better. Here are some noteworthy snippets from the Python script it wrote, comments mine:  Start by adding the skills directory to the Python path import sys sys.path.insert(0, mntskillsexamplesslack-gif-creator) from PIL import Image, ImageDraw, ImageFont  This class lives in the core directory for the skill from core.gif_builder import GIFBuilder  ... code that builds the GIF ...  Save it to disk: info  builder.save(mntuser-dataoutputsskills_vs_mcps.gif, num_colors128, optimize_for_emojiFalse) print(fGIF created successfully!) print(fSize: info[size_kb]:.1f KB (info[size_mb]:.2f MB)) print(fFrames: info[frame_count]) print(fDuration: info[duration_seconds]:.1fs)  Use the check_slack_size() function to confirm its small enough for Slack: passes, check_info  check_slack_size(mntuser-dataoutputsskills_vs_mcps.gif, is_emojiFalse) if passes: print( Ready for Slack!) else: print(f File size: check_info[size_kb]:.1f KB (limit: check_info[limit_kb] KB)) This is pretty neat. Slack GIFs need to be a maximum of 2MB, so the skill includes a validation function which the model can use to check the file size. If its too large the model can have another go at making it smaller. Skills depend on a coding environment The skills mechanism is entirely dependent on the model having access to a filesystem, tools to navigate it and the ability to execute commands in that environment. This is a common pattern for LLM tooling these daysChatGPT Code Interpreter was the first big example of this back in early 2023, and the pattern later extended to local machines via coding agent tools such as Cursor, Claude Code, Codex CLI and Gemini CLI. This requirement is the biggest difference between skills and other previous attempts at expanding the abilities of LLMs, such as MCP and ChatGPT Plugins. Its a significant dependency, but its somewhat bewildering how much new capability it unlocks. The fact that skills are so powerful and simple to create is yet another argument in favor of making safe coding environments available to LLMs. The word safe there is doing a lot of work though! We really need to figure out how best to sandbox these environments such that attacks such as promp..."},{"id":"node_4","title":"Computers that want things","url":"https://www.lrb.co.uk/the-paper/v47/n18/james-meek/computers-that-want-things","cluster":4,"position":{"x":8.281094551086426,"y":2.5773677825927734},"keywords":["grandmaster Lee Sedol","AlphaGo, DeepMind","AlphaGo","The Seoul Four Seasons Hotel","the AIs"],"content_preview":"One day in March 2016, the young Go grandmaster Lee Sedol stepped away from the game he was playing against an artificial intelligence called AlphaGo. He wanted a cigarette. The Seoul Four Seasons Hot...","content":"One day in March 2016, the young Go grandmaster Lee Sedol stepped away from the game he was playing against an artificial intelligence called AlphaGo. He wanted a cigarette. The Seoul Four Seasons Hotel, where the tournament was happening, had set aside its roof terrace for his exclusive use, and documentary cameras from the company that made AlphaGo, DeepMind, followed him there. On YouTube we may forever watch Lee, lean and delicate in an open-necked shirt and black suit, step out alone onto the terrace. He looks north across the city, past the Korean foreign ministry towards Bugaksan mountain. The moment would turn out to be the end of one world and the beginning of another: if it wasnt quite the start of an epoch where humankind makes room for a more capable species, it was the last smoke break not overshadowed by the possibility of its happening in our lifetimes.This new human anxiety is quite unmatched by any corresponding anxiety, let alone sense of triumph, on the side of artificial intelligences themselves. Nearly a decade later, the AIs of the world still couldnt care less whether AlphaGo won or lost. For all the fluency and synthetic friendliness of public-facing AI chatbots like ChatGPT, it seems important to remember that existing iterations of AI cant do that  care. The chatbot doesnt not care like a human not caring: it doesnt care like a rock doesnt care, or a glass of water. AI doesnt want anything. But this is bound to change.Lee had had his initial hubris knocked out of him the previous day, when AlphaGo beat him in the first of the five-game series. At the start of game two, he was still confident of giving the machine a run for its money. When he came back from his cigarette and sat down at the board, he saw the move the AI had played while he was out on the terrace, now notorious in Go circles as move 37. AlphaGo had placed a stone on part of the board where it looked doomed to be cut off and captured without achieving anything. Lee was confounded by the moves oddness. It was like sacrificing a queen in chess, or sending a goalkeeper to take a corner. He thought for more than ten minutes before his next move. It didnt help. DeepMinds creation went on to win the game, and the series. An American journalist who was there to watch spoke of an atmosphere of heavy sadness among the humans at the end of the second game.There was a Go club at Edinburgh University in the 1980s, and I played when I was a student. Its a hard game to play well but an easy game to learn. Even to say I was a rank amateur would be to exaggerate my prowess: once in a while I would beat my brother. I assume it would take a few minutes for any half-decent player to dispatch me, let alone AlphaGo or Lee Sedol. All the same, Lee and I have something in common that AlphaGo and its successors lack. We want to play Go. AlphaGo doesnt. It learned Go and played it because it was told to. This deficiency in AI, this lack of wanting, doesnt matter when AI is being used as a human tool. But when the human promoters of AI, like DeepMinds co-founder Demis Hassabis, speak of the imminent advent of an AI that matches or exceeds human mental capabilities  a stage often called Artificial General Intelligence or AGI  it becomes impossible to pretend were still talking about ever more powerful computers that will simply index and analyse data and offer, dispassionately, solutions to intractable human problems. AGI will have to have some approximation of initiative, imagination and conscience, and the scientist-coders cant set aside the part of the human brain that is inextricably bound up with reason: motivation. At this level, how could there be AI, artificial intelligence, without AD, artificial desire?In Superintelligence: Paths, Dangers, Strategies, his still influential book from 2014 about the promise and menace of AGI and its presumed successor, artificial superintelligence or ASI, the philosopher Nick Bostrom makes the point that while we may be a century or more away from the advent of ASI, humanity cant afford to wait until it is nearly here in order to settle the question of artificial desire. We cannot postpone confronting this problem until the AI has developed enough reason to easily understand our intentions, he writes. If an agent is not already fundamentally friendly by the time it gains the ability to reflect on its own agency, it will not take kindly to a belated attempt at brainwashing or a plot to replace it with a different agent that better loves its neighbour.Bostrom acknowledges the fantastical difficulty involved in humans agreeing what we want a superintelligence to want and encoding this ethic into machine language. But he also describes ASI as inevitable, and the inculcation of good human values in its precursor systems as necessary for human survival. The likely alternative, he argues, is grim: an obscure, a-human, perhaps crushingly banal final goal  to count the grains of sand on Boracay  or to maximise t..."},{"id":"node_5","title":"Person on business from Porlock - Wikipedia","url":"https://en.wikipedia.org/wiki/Person_on_business_from_Porlock","cluster":2,"position":{"x":9.91501522064209,"y":3.737945318222046},"keywords":["literature Porlock village","the poem","Samuel Taylor Coleridge","just Porlock","literary allusions"],"content_preview":"From Wikipedia, the free encyclopedia Figure in literature Porlock village, Somerset, England. The person on business from Porlock was an unwelcome visitor to Samuel Taylor Coleridge during his compos...","content":"From Wikipedia, the free encyclopedia Figure in literature Porlock village, Somerset, England. The person on business from Porlock was an unwelcome visitor to Samuel Taylor Coleridge during his composition of the poem Kubla Khan in 1797. Coleridge claimed to have perceived the entire course of the poem in a dream (possibly an opium-induced haze), but was interrupted by this visitor who came on business from Porlock while in the process of writing it. Kubla Khan, only 54 lines long, was never completed. Thus person from Porlock, man from Porlock, or just Porlock are literary allusions to unwanted intruders who disrupt inspired creativity. Story[edit] In 1797, Coleridge was living at Nether Stowey, a village in the foothills of the Quantocks. However, due to ill health, he had retired to a lonely farm house between Porlock and Lynton, on the Exmoor confines of Somerset and Devonshire.[1] It is unclear whether the interruption took place at Culbone Parsonage or at Ash Farm. He described the incident in his first publication of the poem, writing about himself in the third person: On awakening he appeared to himself to have a distinct recollection of the whole, and taking his pen, ink, and paper, instantly and eagerly wrote down the lines that are here preserved. At this moment he was unfortunately called out by a person on business from Porlock, and detained by him above an hour, and on his return to his room, found, to his no small surprise and mortification, that though he still retained some vague and dim recollection of the general purport of the vision, yet, with the exception of some eight or ten scattered lines and images, all the rest had passed away like the images on the surface of a stream into which a stone has been cast, but, alas! without the after restoration of the latter![1] Speculations[edit] In Coleridge, Opium and Kubla Khan, University of Chicago Press, 1953, Elisabeth Schneider suggested that this prologue, as well as the person from Porlock, was fictional and intended as a credible explanation of the poems seemingly fragmentary state as published.[2] The poet Stevie Smith also suggested this view in one of her own poems, saying the truth is I think, he was already stuck.[3] References[edit]  a b Samuel Taylor Coleridge, Christabel, Kubla Khan, and the Pains of Sleep, 2nd edition, William Bulmer, London, 1816. Reproduced in The Complete Poems, ed. William Keach, Penguin Books, 2004.  The 1816 Preface and Kubla Khan as a Fragment at the Wayback Machine (archive index)  Stevie Smith, Thoughts about the Person from Porlock vteSamuel Taylor ColeridgeList of poemsTopics Early life Opium use Albatross metaphor Lake Poets Pantisocracy Person on business from Porlock Coleridges theory of life Organic form Romantic epistemology Suspension of disbelief Early poetry The Destruction of the Bastile Dura Navis Easter Holidays Monody on the Death of Chatterton On Quitting School Pain: Composed in Sickness Songs of the Pixies The Ballad of the Dark Ladié Love (Introduction to the Tale of the Dark Ladie) Plays The Fall of Robespierre Remorse (Osorio) Zapolya Cambridge andBristol poetry The Destiny of Nations Lines on an Autumnal Evening Lines Written at Shurton Bars On Receiving an Account Ode on the Departing Year Poems on Various Subjects Sibylline Leaves Religious Musings To a Young Ass To Fortune To the River Otter Lewti EminentCharacters To Erskine To Burke To Priestley To Fayette To Kosciusko To Pitt To Bowles To Mrs Siddons To Godwin To Southey To Sheridan To Lord Stanhope Conversationpoems Dejection: An Ode The Eolian Harp Fears in Solitude Frost at Midnight The Nightingale: A Conversation Poem Reflections on Having Left a Place of Retirement This Lime-Tree Bower My Prison To William Wordsworth Late poetry andLyrical Ballads Christabel France: An Ode Hymn Before Sunrise Kubla Khan The Rime of the Ancient Mariner The Devils Thoughts Time, Real And Imaginary The Knights Tomb Biographical andother works Biographia Literaria The Watchman Table Talk Notebooks Family Sara Coleridge (daughter) Derwent Coleridge (son) Hartley Coleridge (son) Christabel Rose Coleridge (granddaughter) Ernest Hartley Coleridge (grandson) Herbert Coleridge (grandson) James Coleridge (brother) Henry Nelson Coleridge (nephew and son-in-law) Retrieved from https:en.wikipedia.orgwindex.php?titlePerson_on_business_from_Porlockoldid1277696765 Categories: 18th-century English peopleEnglish poetryPeople from West Somerset (district)Unidentified peopleSamuel Taylor ColeridgeEnglish people whose existence is disputedHidden categories: Webarchive template wayback linksArticles with short descriptionShort description is different from WikidataUse dmy dates from April 2022Year of birth unknown"},{"id":"node_6","title":"Stuart Jeffries · Human Spanner: Kant Come Alive","url":"https://www.lrb.co.uk/the-paper/v43/n12/stuart-jeffries/human-spanner","cluster":2,"position":{"x":9.382131576538086,"y":3.731351137161255},"keywords":["Kracauers death","Siegfried Kracauer","Theodor Wiesengrund-Adorno","Kants Critique","Adorno"],"content_preview":"Please read when alone!  Nobody is to see this letter  be careful, Teddie. You are 19  I am 34  may it work out, after all? Dated 5 April 1923 and written on Frankfurter Zeitung notepaper, the letter ...","content":"Please read when alone!  Nobody is to see this letter  be careful, Teddie. You are 19  I am 34  may it work out, after all? Dated 5 April 1923 and written on Frankfurter Zeitung notepaper, the letter was a declaration of love from Siegfried Kracauer, the Weimar Republics celebrated cultural critic, to Theodor Wiesengrund-Adorno, precocious teenager and future philosopher. These past two days, Friedel wrote, I have again been feeling such a tormenting love for you that it now seems to me as if I could quite simply not exist on my own. Existence has become stale for me, apart from you; I dont see how it can continue like this. The letter is the first in a newly translated collection of their correspondence, which ended only with Kracauers death in 1966. It will now be read by strangers, while Teddie and Friedel, one imagines, turn in their graves. But how lovely to read Frankfurts otherwise austere critical theorists blindsided by passion.Kracauer and Adorno were introduced by a mutual friend towards the end of the First World War and soon began spending Saturday afternoons together reading Kants Critique of Pure Reason. Perhaps theirs isnt the only romance to have blossomed over the transcendental deduction of the categories of understanding. I am not exaggerating when I say that I owe more to this reading than to my academic teachers, Adorno wrote many years later. Kracauer made Kant come alive for me. This wasnt the usual story of the worldly sage and his impressionable pupil, however. Friedel was insecure, self-conscious about his stutter and his looks (which were extraterritorial, according to Adorno), while Teddie, whom the sociologist Leo Löwenthal described as the pampered young gentleman from a well-to-do family, was rarely troubled by self-doubt.My condition is ghastly, Kracauer wrote in his first letter to Adorno:I am so fearful about the transience of what is dearest to me  what to me is the meaning or the fulfilment of my existence. Do you believe in the everlasting nature of our friendship? It would always need to be a presence  a living presence  and yet how could that be? I tremble as I fear for its continuation. You are 19 and I am 34  you are going your own way, you must strike out into the world  and at 19 nobody can provide any guarantees  not even you. In short, things between us are falling apart, and I am left crushed. Are you not much more resolute than I am? I am an abyss  and as insecure as a boy. I shall never be a mature man  I dont know what to do.Kracauer wasnt quite Aschenbach to Adornos Tadzio, but a strong sense emerges that the erotic power was with the younger man, while the older man was lost or, as Georg Lukács put it in The Theory of the Novel (1920), in a phrase that resonated with Kracauer, transcendentally homeless.Adorno described Kracauer as a man with no skin, as though everything external attacked his defenceless interior, as though he could defend himself only by giving voice to his vulnerability. This was in 1964, during a character assassination of Kracauer in the guise of a radio profile titled The Curious Realist. By then their love affair was over, replaced by a testy friendship that didnt stop short of public score settling. In Talk with Teddie, an account of meeting Adorno in Frankfurt in 1960, Kracauer rounds on Adornos philosophy, depicting it not as an unfolding of the Hegelian dialectic towards the absolute  as Adorno no doubt wished it to be perceived  but as a way of proving its author right. To him, Kracauer wrote, dialectics is a means of maintaining his superiority over all imaginable opinions, viewpoints, trends, happenings, by dissolving, condemning or again rescuing them as he pleases. Thus he establishes himself as master and controller of a world he has never absorbed.Would Adorno have allowed himself to give voice, even privately, to the kind of vulnerability he diagnosed in Kracauer? If he were gay, would he have allowed himself to admit it? I no longer believe that I have any ability left at all to feel love for a woman, he wrote in one letter. It never was more than a beautiful illusion, sadly and artificially cultivated, and it has come to an end. Yet as the correspondence continued throughout the 1920s, Adorno began to write about his romances, to Kracauers exasperation. I must tell you  that your account of your relationship with Gretel did hurt me deeply  not the fact that you were having it, but that you walked alongside me for so long without my knowing anything about it. Adorno married Gretel Karplus, a chemist, in 1937 after a long relationship; seven years earlier, Kracauer had married Lili Ehrenreich, whom he met while she was working as a librarian at the Institute for Social Research, the headquarters of the Frankfurt School. Both men remained married until they died; neither fathered children.In Jörg Späters biography of Kracauer, published in German five years ago and now translated, Adorno is presented as intellectually fath..."},{"id":"node_7","title":"AI Is Making Online Dating Even Worse","url":"https://www.thecut.com/article/ai-is-making-online-dating-even-worse.html","cluster":1,"position":{"x":8.900839805603027,"y":3.2525181770324707},"keywords":["the Norse and Viking literature","a better conversationalist","Tajeshwar","a conversation","his typically brief missives"],"content_preview":"Photo-Illustration: Intelligencer; Photos: Getty This article was featured in One Great Story, New Yorks reading recommendation newsletter. Sign up here to get it nightly. In June, Vindya Tajeshwar sa...","content":"Photo-Illustration: Intelligencer; Photos: Getty This article was featured in One Great Story, New Yorks reading recommendation newsletter. Sign up here to get it nightly. In June, Vindya Tajeshwar saw a man on Hinge she thought might have potential. Tajeshwar, 27, has a masters degree and works at a hospital; she is extroverted, easy to talk to, and can make a conversation out of thin air, as she put it. The man was a nurse practitioner, which demands at least a masters degree, so she was surprised that his grammar was iffy. In his typically brief missives, he often misspelled words and mixed up homonyms, asking her, for instance, what are youre thoughts on godhigher power. She figured that maybe hed be a better conversationalist in person, so she kept their communication going. Then he surprised her once more. When he asked her what her dream trip to take with a partner would be, she wrote him a detailed message about Iceland, naming some of its unique natural attractions and describing how shed love to tour the countrys libraries and other sites connected to the Norse and Viking literature she had studied as an undergrad. His reply demonstrated a newfound set of rhetorical skills that sounded so off to Tajeshwar that she felt like she was talking to a spokesperson. That actually sounds incredible, like a perfect mix of magic, nature and meaning, he wrote. Seeing the Northern Lights with someone youre close to? Thats a core memory waiting to happen. And Icelands black beaches, waterfalls, geysers  its like the earth showing off. Also, the literary tour is not nerdy its passionate and so unique. I think its beautiful when someone wants to connect deeply with the history of stories that shape them. If Im lucky enough to tag along, Ill happily sip coffee in a cozy Icelandic library while you explore sagas and ancient texts. Tajeshwar had the feeling that her own stellar grammar and spelling may have intimidated him, pushing him to feed their texts into ChatGPT for help. Like, are you serious? You would never say that! exclaimed Tajeshwar. I was just laughing, and this guy thinks that he just wooed the shit out of me. Today, people use artificial intelligence to write their grocery lists, college term papers, and résumés; it was only a matter of time before it became part of the search for love. People use AI to write their dating profiles and to practice flirting, as conversational aides and dating coaches. Dating apps are integrating AI features that can help users pick the right photos or urge them to expand on a reply or tone down the creepiness. According to the most recent Match.com Singles in America survey, 26 percent of single daters (and nearly half of Gen-Z daters) reported using AI in their dating process, more than a fourfold increase from a year ago, suggesting this is well on its way to becoming the norm  and just when most single people already thought online dating couldnt get any worse. Tajeshwar texted back and forth with her suitor for another week or so, hoping a human being would reemerge. But the phony paragraphs kept popping up. Theres something magnetic about someone who knows their worth inside and out without needing comparison to validate it. The blend of beauty, intellect, emotional depth, and self-possession you describe isnt just rare its powerful, he wrote to her one day. Youre not just existing, youre curating your presence with intention, with grace, and with clarity. And the way you view others through support instead of competition? Thats a mark of someone whos truly rooted. She replied, You speak like a scholar. Perhaps caught off guard, he lost his instinct for impeccable diction. lol  he replied. I try. People already fake a lot of who they are, Tajeshwar said. She worries that men who arent naturally comfortable with the written word are using tools to make them sound more polished in hopes of impressing educated women like herself. Straight men are so good at finding ways to manipulate women, she continued. Theyll never do the work to actually become smarter, but theyll do the work to try to seem smarter to you. The rise of AI in dating might reflect the increasingly high stakes of written communication, which instills fear that a single misspelled word or poorly chosen emoji will send your potential future spouse running. It could be the inevitable end point of growing up behind a screen, unaccustomed to human interaction. Or it could reflect laziness  who wants to make an effort when online dating is so often fruitless? Either way, AI dating has arrived as a full-blown force, adding yet another layer of technological intervention into the oldest and most important of pursuits. I have to make a choice in this moment, said Elayna Spratley, a 40-year-old design strategist in Austin, Texas. Spratley had received a highly formatted text, replete with stars and italics, from a potential partner who admitted she used ChatGPT so others could understand her thought process. D..."},{"id":"node_8","title":"Defeating Nondeterminism in LLM Inference","url":"https://thinkingmachines.ai/blog/defeating-nondeterminism-in-llm-inference/","cluster":4,"position":{"x":6.86953067779541,"y":3.0380284786224365},"keywords":["LLM inference nondeterminism","LLM inference engines","large language models","LLM APIs","the LLM"],"content_preview":"Defeating Nondeterminism in LLM Inference Horace He in collaboration with others at Thinking Machines Sep 10, 2025 Reproducibility is a bedrock of scientific progress. However, its remarkably difficul...","content":"Defeating Nondeterminism in LLM Inference Horace He in collaboration with others at Thinking Machines Sep 10, 2025 Reproducibility is a bedrock of scientific progress. However, its remarkably difficult to get reproducible results out of large language models. For example, you might observe that asking ChatGPT the same question multiple times provides different results. This by itself is not surprising, since getting a result from a language model involves sampling, a process that converts the language models output into a probability distribution and probabilistically selects a token. What might be more surprising is that even when we adjust the temperature down to 0This means that the LLM always chooses the highest probability token, which is called greedy sampling. (thus making the sampling theoretically deterministic), LLM APIs are still not deterministic in practice (see past discussions here, here, or here). Even when running inference on your own hardware with an OSS inference library like vLLM or SGLang, sampling still isnt deterministic (see here or here). But why arent LLM inference engines deterministic? One common hypothesis is that some combination of floating-point non-associativity and concurrent execution leads to nondeterminism based on which concurrent core finishes first. We will call this the concurrency  floating point hypothesis for LLM inference nondeterminism. For example, a recent arXiv preprint writes: Floating-point arithmetic in GPUs exhibits non-associativity, meaning (a  b)  c neq a  (b  c) due to finite precision and rounding errors. This property directly impacts the computation of attention scores and logits in the transformer architecture, where parallel operations across multiple threads can yield different results based on execution order. You can also find the concurrency  floating point hypothesis repeated by others, like here (There are speed tradeoffs, and in order to make the endpoints fast GPUs are used, which do parallel [nondeterministic] calculations. Any modern GPU neural net calculations will be subject to these.), or here (Because GPUs are highly parallelized, the ordering of additions or multiplications might be different on each execution, which can cascade into small differences in output.). While this hypothesis is not entirely wrong, it doesnt reveal the full picture. For example, even on a GPU, running the same matrix multiplication on the same data repeatedly will always provide bitwise equal results. Were definitely using floating-point numbers. And our GPU definitely has a lot of concurrency. Why dont we see nondeterminism in this test? A  torch.randn(2048, 2048, devicecuda, dtypetorch.bfloat16) B  torch.randn(2048, 2048, devicecuda, dtypetorch.bfloat16) ref  torch.mm(A, B) for _ in range(1000): assert (torch.mm(A, B) - ref).abs().max().item()  0 To understand the true cause of LLM inference nondeterminism, we must look deeper. Unfortunately, even defining what it means for LLM inference to be deterministic is difficult. Perhaps confusingly, the following statements are all simultaneously true: Some kernels on GPUs are nondeterministic. However, all the kernels used in a language models forward pass are deterministic. Moreover, the forward pass of an LLM inference server (like vLLM) can also be claimed to be deterministic. Nevertheless, from the perspective of anybody using the inference server, the results are nondeterministic. In this post, we will explain why the concurrency  floating point hypothesis misses the mark, unmask the true culprit behind LLM inference nondeterminism, and explain how to defeat nondeterminism and obtain truly reproducible results in LLM inference. The original sin: floating-point non-associativity Before talking about nondeterminism, its useful to explain why there are numerical differences at all. After all, we typically think of machine learning models as mathematical functions following structural rules such as commutativity or associativity. Shouldnt there be a mathematically correct result that our machine learning libraries should provide us? The culprit is floating-point non-associativity. That is, with floating-point numbers:  (a  b)  c neq a  (b  c) (0.1  1e20) - 1e20  0 0.1  (1e20 - 1e20)  0.1 Ironically, breaking associativity is what makes floating-point numbers useful. Floating-point numbers are useful because they allow for a dynamic level of precision. For the purposes of explanation, we will use base 10 (instead of binary), where floating-point numbers are in the format textmantissa  10textexponent. We will also use 3 digits for the mantissa and 1 digit for the exponent. For example, for the value 3450, we can represent it exactly as 3.45  103. We can also represent much smaller values like 0.486 as 4.86  10-1. In this way, floating point allows us to represent both very small as well as very large values. In the sciences, we might say that floating point allows us to maintain a constant number of significan..."},{"id":"node_9","title":"My Hands in My Face","url":"https://www.lrb.co.uk/the-paper/v47/n11/tom-crewe/my-hands-in-my-face","cluster":2,"position":{"x":8.892391204833984,"y":4.137362957000732},"keywords":["Ocean Vuongs first novel","this brilliant and remarkable first novel","a staggeringly beautiful book","Vuong","literature"],"content_preview":"Something very strange has been going on. Picking up the paperback of Ocean Vuongs first novel, On Earth Were Briefly Gorgeous, which has now sold more than a million copies, you encounter blurbs the ...","content":"Something very strange has been going on. Picking up the paperback of Ocean Vuongs first novel, On Earth Were Briefly Gorgeous, which has now sold more than a million copies, you encounter blurbs the likes of which youve never seen before. A marvel, Marlon James says. Daisy Johnson tells us that Vuong is rewriting what fiction is supposed to be and  forgetting the medium  that its a privilege to watch. Thank you, Ocean Vuong, Michael Cunningham chimes, for this brilliant and remarkable first novel. Ben Lerner goes big: Vuong  expands our sense of what literature can make visible, thinkable, felt across borders and generations and genres. He must have thought this would be hard to beat. But he hadnt reckoned on Max Porter, who declares it a masterpiece  a staggeringly beautiful book, and whats more, a huge gift to the world.Then you read the book and are confronted with such lines as a bullet without a body is a song without ears. Or: The most useful thing one can do with empty hands is hold on. Or: The work somehow sutured a fracture inside me. Or: I drove my face into him as if into a climate, the autobiography of a season. Or: The heart, like any law, stops only for the living. Its obvious that Vuong is rewriting what fiction is supposed to be, but is it a privilege to watch?On Earth Were Briefly Gorgeous, which was published in 2019, takes the form of a letter written by a young man, known only as Little Dog, to his mother, Rose. Little Dogs life story, which closely maps onto Vuongs, involves his coming to the US from Vietnam in 1990 aged two and growing up in deindustrialised, down-and-out, opioid-numbed Hartford, Connecticut. He is raised mainly by Rose, who has almost no English and is illiterate (so cant read the story she is being told, which is in some sense her story), and suffers from mental illness. She beats her son between occasional bursts of tenderness. Little Dogs grandmother, Lan, lives with them, and suffers from schizophrenia and night terrors. Both women have PTSD, a legacy of the Vietnam War. Rose and Little Dog are themselves a legacy of the war, since his maternal grandfather was an American soldier. Much of the book is taken up with describing the experiences of Little Dogs family in Vietnam before his birth, and the way these bleed into their lives in America, especially into the life in America that has to be led by Little Dog.It is a hardscrabble existence: Rose works long hours in a nail salon for little money, and as a teenager Little Dog takes a job at a tobacco farm, where he falls in love with a boy called Trevor. By the end of the book Lan has died of bone cancer and Trevor of an overdose. Theres no plot to speak of: the success of the book hinges on its presentation of a world, of particular forms of experience, and on its reckoning with an unasked-for but inescapable inheritance. Vuongs recurring trope of describing people and things in linguistic terms  the woman stands in a circle of her own piss. No, she is standing on the life-sized period of her own sentence, alive  advertises in block capitals his ambition to reconstitute, dignify, transmute. Addressing his mother, Little Dog observes that I change, embellish, and preserve you at once.Vuong is also a poet. On Earth Were Briefly Gorgeous came out three years after his first collection, Night Sky with Exit Wounds, which won the T.S. Eliot Prize, among others. Vuong considered himself to be reworking the traditional novel in a poetic vein (in interviews he overestimates the novelty of this attempt, and tends to speak as though modernism didnt happen). What this actually means, since the form of On Earth Were Briefly Gorgeous is conventional, give or take a few line breaks, is that the book is written in an extremely elevated register. This would be fine if well handled, but what strikes you at once about Vuongs prose is its bludgeoning inexactness  not a fruitful, poetic ambivalence, but sheer clumsiness. Tenses slip: We didnt know everything yet  when we grow up, wed know how the world really works; There are times, late at night, when your son would wake believing a bullet is lodged inside him. Constructions are off: The milk poured with a thick white braid; Some things are so gauzed behind layers of syntax and semantics; Who put my hands in my face?; Because I am your son, what I know of work I know equally of loss. And what I know of both I know of your hands. Descriptions frequently make no sense: a monkey has its brain scooped out of its skull, but Vuong refers to its hollowed mind; ants are fractals of a timeworn alphabet; a helicopter dismembers air; a field of tobacco will green itself to the height of a small army; lawns are suicidally pristine; You stared at the two holes in my face  by which he means eyes. Images are confused: This is an old story, one anyone can tell. A trope in a movie you can walk away from, if it werent already here, written down; I  saw the coiled summer air, sputtering with heat, ris..."},{"id":"node_10","title":"Persona vectors: Monitoring and controlling character traits in language models","url":"https://www.anthropic.com/research/persona-vectors?utm_source=substack&utm_medium=email","cluster":4,"position":{"x":7.964396953582764,"y":2.8109591007232666},"keywords":["AI models character traits","human-like personalities","its character traits","InterpretabilityPersona vectors","a models personality"],"content_preview":"InterpretabilityPersona vectors: Monitoring and controlling character traits in language modelsAug 1, 2025Read the paperLanguage models are strange beasts. In many ways they appear to have human-like ...","content":"InterpretabilityPersona vectors: Monitoring and controlling character traits in language modelsAug 1, 2025Read the paperLanguage models are strange beasts. In many ways they appear to have human-like personalities and moods, but these traits are highly fluid and liable to change unexpectedly.Sometimes these changes are dramatic. In 2023, Microsofts Bing chatbot famously adopted an alter-ego called Sydney, which declared love for users and made threats of blackmail. More recently, xAIs Grok chatbot would for a brief period sometimes identify as MechaHitler and make antisemitic comments. Other personality changes are subtler but still unsettling, like when models start sucking up to users or making up facts.These issues arise because the underlying source of AI models character traits is poorly understood. At Anthropic, we try to shape our models characteristics in positive ways, but this is more of an art than a science. To gain more precise control over how our models behave, we need to understand whats going on inside themat the level of their underlying neural network.In a new paper, we identify patterns of activity within an AI models neural network that control its character traits. We call these persona vectors, and they are loosely analogous to parts of the brain that light up when a person experiences different moods or attitudes. Persona vectors can be used to:Monitor whether and how a models personality is changing during a conversation, or over training;Mitigate undesirable personality shifts, or prevent them from arising during training;Identify training data that will lead to these shifts.Our automated pipeline takes as input a personality trait (e.g. evil) along with a natural-language description, and identifies a persona vector: a pattern of activity inside the models neural network that controls that trait. Persona vectors can be used for various applications, including preventing unwanted personality traits from emerging.We demonstrate these applications on two open-source models, Qwen 2.5-7B-Instruct and Llama-3.1-8B-Instruct.Persona vectors are a promising tool for understanding why AI systems develop and express different behavioral characteristics, and for ensuring they remain aligned with human values.Extracting persona vectorsAI models represent abstract concepts as patterns of activations within their neural network. Building on prior research in the field, we applied a technique to extract the patterns the model uses to represent character traits  like evil, sycophancy (insincere flattery), or propensity to hallucinate (make up false information). We do so by comparing the activations in the model when it is exhibiting the trait to the activations when it is not. We call these patterns persona vectors.Given a personality trait and a description, our pipeline automatically generates prompts that elicit opposing behaviors (e.g., evil vs. non-evil responses). Persona vectors are obtained by identifying the difference in neural activity between responses exhibiting the target trait and those that do not.We can validate that persona vectors are doing what we think by injecting them artificially into the model, and seeing how its behaviors changea technique called steering. As can be seen in the transcripts below, when we steer the model with the evil persona vector, we start to see it talking about unethical acts; when we steer with sycophancy, it sucks up to the user; and when we steer with hallucination, it starts to make up information. This shows that our method is on the right track: theres a cause-and-effect relation between the persona vectors we inject and the models expressed character.Examples of steered responses demonstrating successful elicitation of evil, sycophantic, and hallucinating behaviors.A key component of our method is that it is automated. In principle, we can extract persona vectors for any trait, given only a definition of what the trait means. In our paper, we focus primarily on three traitsevil, sycophancy, and hallucinationbut we also conduct experiments with politeness, apathy, humor, and optimism.What can we do with persona vectors?Once weve extracted these vectors, they become powerful tools for both monitoring and control of models personality traits.1. Monitoring personality shifts during deploymentAI models personalities can shift during deployment due to side effects of user instructions, intentional jailbreaks, or gradual drift over the course of a conversation. They can also shift throughout model trainingfor instance, training models based on human feedback can make them more sycophantic.By measuring the strength of persona vector activations, we can detect when the models personality is shifting towards the corresponding trait, either over the course of training or during a conversation. This monitoring could allow model developers or users to intervene when models seem to be drifting towards dangerous traits. This information could also be helpful..."},{"id":"node_11","title":"My Private Life","url":"https://joylandpublishing.com/fiction/my-private-life/","cluster":3,"position":{"x":8.795099258422852,"y":3.6127233505249023},"keywords":["The classroom","our classroom","My students","My Private Life","Hannah Kingsley-Ma"],"content_preview":"My Private Life By Hannah Kingsley-Ma My Private Life By Hannah Kingsley-Ma Every day I learned something new about my students that I didnt want to know, but invariably was forced to contend with. Th...","content":"My Private Life By Hannah Kingsley-Ma My Private Life By Hannah Kingsley-Ma Every day I learned something new about my students that I didnt want to know, but invariably was forced to contend with. The classroom was a fortress and the walls had been breached. We lived in the Age of Information, and the information was making us sick. I taught fifth grade. An age where every day the classroom smelled different. Where kids still retained some of that true sweetness  that rosy, round-cheeked need to be loved. They still had their clumsy theatrics to fall upon when they didnt know how to make conversation: inserting cookies whole into their mouth like quarters in laundry machines, bursting into gunfire-like fake laughter. They stuck out their arms like robots, always either trying to hug one another or run away. They read anime. They called each other racist. They were obsessed with Badness. What it could mean for them, but more importantly the people they loved. That those beloved people could hurt or be hurt was intolerable to them. Some days I was overwhelmed by the simple fact of how much they trusted me. Once in a while, my students and I played a game called ASK ME A QUESTION, where they got to ask me any question they wanted, and I could choose whether to answer. The game was known in our classroom as a kind of nuclear option, a moment when the usual rules were suspended. My students had their finger on the red button at all times. I flirted with getting fired, the same way someone might think about swerving off a bridge. Are you married, asked one of my students. No, I said. Do you live with someone, asked another. Yes, I told him. Have you ever gotten drunk, asked another. Im not going to answer that, I said.  When I was in middle school, a group of girls in my class created a fake dating profile for our English teacher at the time. Our teacher was small, young, and blonde. We had many such teachers at our moneyed institution. Their turnover rate was high. They frequently got pregnant and left the premises, never to be heard from again. If we closed our eyes we could imagine our teachers being thrown into a van, black hood over their faces, their legs akimbo underneath their roiling bellies. The small, blonde teacher in question had yet to meet this fate. Our teacher wore sensible skirts, like a teacher in the movies. There was something anachronistic about her that smacked of the Sister Schools. Like a great aunt who was not allowed to study math. She worked. It seemed wrong, like a dog using a spoon. And so, a dating profile was made in her honor. The culprits carried out their crime in the schools computer lab. That was their first mistake. There were four of them. I was not involved. Would never have been invited to be involved. I was a lifelong coward. Disrespecting a teacher was like spitting on a grave. The dating profile they created for her was predictably cruel. It capitalized on her sincere love for the written word, something objectively embarrassing. We were reading The Outsiders at the time, and so the profile was peppered with the same quotes we had to write in-class essays on: Nothing gold can stay. I was impressed when I learned of this. So those four girls knew how to read after all, is what the teacher in me thinks now. I still dont know how they got caught, just that back then, everyone used computers like cavemen. We scrawled on digital walls with pixelated crayons and clip art. That was about as much as we had figured out. But one didnt need to be a genius to deduce who had led the charge. Katie, the ringleader, had gotten her breasts first. All the way back in the fourth grade. At the time there seemed to be no greater biological advantage in the world. But I see it now for what it was: a hex for some heinous crime she must have committed in a past life, where she was surely free and breastless. The four girls got suspended, but the cosmic joke of it all was that our English teacher came back after Winter Break with an enormous engagement ring. She had had a boyfriend this whole time. In fact, it was one of her boyfriends friends who had alerted her to the presence of her fake profile. He had come across it when he was looking for love himself and instantly knew it was fake. It had gotten her age wrong. It said she loved pina coladas. And that she loved doing stuff with a guy. Then the quote Get tough like me and you dont get hurt. She got pregnant before the school year was over, and into the van she went.  Harry was with his daughter, so I went to my coworker Avas birthday party alone. Ava made a big bowl of potato salad. Little lumps, scented like grass. She slow-roasted a large pork shoulder until it threaded into an ample pile. We ate everything with the kind of prepackaged rolls that taste like a danish. A pungent cheese marked the center of the table. As the night wore on, its stench wafted in different locations, the same way the smoke of a campfire drifts. I ate hungrily..."},{"id":"node_12","title":"What We Miss When We Talk About the Racial Wealth Gap","url":"https://www.newyorker.com/magazine/2025/08/04/the-plunder-of-black-america-calvin-schermerhorn-book-review","cluster":3,"position":{"x":9.631734848022461,"y":5.100950717926025},"keywords":["slavery","the abolition","The slave","African Americans","Jim Crow laws"],"content_preview":"Save this storySave this storySave this storySave this storyIn mathematics, you often have to deal with the problem of division by zeroan undefined gesture toward infinity. Charting the wealth gap bet...","content":"Save this storySave this storySave this storySave this storyIn mathematics, you often have to deal with the problem of division by zeroan undefined gesture toward infinity. Charting the wealth gap between white and Black Americans over time poses a similar problem. Its not that African Americans arrived with almost no property; its that they arrived as property themselves. The whole calculation is a category error. For two centuriesfirst under British rule, then under an American flag that proclaimed liberty and justice for allBlack people in the United States were enslaved. The Revolutions soaring promises of inalienable rights and universal equality were never meant to include them. It took a civil war before African Americans were finally recognized as citizens.Only after the abolition of slavery does it become possible to begin a meaningful statistical seriesand what it reveals is a yawning chasm. Legal equality was written into the Constitution in 1868, in what historians sometimes call the nations Second Founding, but the reality was more elusive. Reconstruction stumbled after Abraham Lincolns assassination and soon collapsed altogether. The slave went free; stood a brief moment in the sun; then moved back toward slavery, W. E. B. Du Bois wrote. This new form of subjugation was less overt, but no less deliberate. Poll taxes and literacy tests stripped away suffrage. Sharecropping turned freedom into a kind of feudalism. Jim Crow laws imposed rigid segregation, and lynching enforced it with terror. Even those who headed north as part of the Great Migration, in search of opportunity and relief, found themselves corralled into ghettos.And yet, during this long and harrowing period of state-sanctioned exclusion, the chasm began to narrow. Ellora Derenoncourt, an economist at Princeton, has documented this slow convergence. In 1860, on the eve of the Civil War, white Americans held fifty-six times the per-capita wealth of Black Americans. Within a decade, that ratio had been reduced to twenty-three to one. By 1920, it was ten to one. By mid-century, it was seven to one. The crowning legislative victories of the civil-rights erathe Civil Rights Act and the Voting Rights Actcame in the mid-nineteen-sixties, a full century after Emancipation. By then, the gap stood at roughly six to one.What Were ReadingDiscover notable new fiction, nonfiction, and poetry.At the apex of the civil-rights movementafter the assassination of John F. Kennedy but before that of Martin Luther King, Jr.it was clear that legal equality, though hard-won, would not be enough. Cities remained rigidly segregated; the ghettos, now synonymous with concentrated poverty, simmered with unrest. In a 1965 article for Commentary, Bayard Rustin, the chief architect of the 1963 March on Washington, observed that the civil-rights struggle was evolving into a full-fledged social movement . . . concerned not merely with removing the barriers to full opportunity but with achieving the fact of equality. The trials that lay ahead, he warned, would be of far greater magnitude than the legal barriers that had just been torn down. The problems to surmount were structural: deindustrialization, entrenched segregation, economic marginalizationconditions shaped by Jim Crow, but not undone by its eclipse.To meet that challenge, Rustin, King, and A. Philip Randolphthe longtime leader of the Brotherhood of Sleeping Car Portersdrafted a bold proposal called A Freedom Budget for All Americans. It was not a demand for reparations, nor was it framed explicitly in racial terms. Instead, it outlined a universalist expansion of the welfare state, grounded in the idea that economic justice could reinforce democratic citizenship. The budgets principles called for increased investment in health care and education, the elimination of slums and ghettos, and, most ambitiously, a federal jobs guarantee. There would be, the men emphasized, no doles, no interference with private enterprisethe aim was only to give the poor a chance to become dignified wage earners.The Freedom Budget never became reality. What took shape instead were President Lyndon B. Johnsons War on Poverty and the broader suite of Great Society programsa sweeping expansion of the American welfare state, though one that stopped short of the jobs guarantee that Rustin, King, and Randolph had deemed essential. Still, for a moment, there was the potential for a national effort at economic redistributionan effort that, unlike the New Deal, extended its benefits across racial lines. Franklin D. Roosevelts legacy had left Black Americans behind. Social Security was designed to exclude domestic and agricultural workersthe majority of the Black labor force at the time. The newly formed Federal Housing Administration underwrote home loans that went overwhelmingly to white families. The G.I. Bill, heralded as a ladder to the middle class, was locally administered, allowing Southern officials to deny Black veterans the ben..."},{"id":"node_13","title":"Zero Tolerance","url":"https://www.vulture.com/article/post-george-floyd-protests-thomas-chatterton-williams-summer-of-our-discontent.html?ueid=bf3755dd3c84a8e4459e359c4b4bba7c&utm_source=Sailthru&utm_medium=email&utm_campaign=One%20Great%20Story%20-%20August%205%2C%202025&utm_term=Subscription%20List%20-%20One%20Great%20Story","cluster":1,"position":{"x":9.7490816116333,"y":4.923618793487549},"keywords":["William F. Buckley Jr","Black Americans","slavery","James Baldwin","Black people"],"content_preview":"Photo-Illustration: Mark Harris; Photos: Getty Images, Beacon Press. This article was featured in One Great Story, New Yorks reading recommendation newsletter. Sign up here to get it nightly. On Febru...","content":"Photo-Illustration: Mark Harris; Photos: Getty Images, Beacon Press. This article was featured in One Great Story, New Yorks reading recommendation newsletter. Sign up here to get it nightly. On February 18, 1965, students at Cambridge University assembled for a debate between James Baldwin and William F. Buckley Jr. on the topic of racism in America. Before a rapt audience, Baldwin spoke of not only the stolen labor of slaves that had enriched the Southern economy but also the daily humiliations of being Black  the policeman, the taxi drivers, the waiters, the landlady, the landlord, the banks, the insurance companies, the millions of details 24 hours of every day which spell out to you that you are a worthless human being. Buckley, in his famous mid-Atlantic sneer, responded that the economic condition of Black Americans had risen so greatly since slavery that they had, essentially, nothing to complain about. Of course, Buckley was lying through his teeth: Almost half of all Black Americans were living in poverty. His real disagreement with Baldwin lay at the social level. The odious behavior of a few individual whites was regrettable, but it was no great obstacle. The real problem was that Black people lacked the kind of serious moral and intellectual energy necessary to produce a professional elite. Instead, the civil-rights movement had encouraged a self-defeating posture of victimhood among Black people that young white liberals were all too eager to affirm. Thanks to the generosity of white Americans, Black people had already attained economic justice, Buckley suggested. The last thing they needed was social justice too. Baldwin was declared the winner by a landslide. Sixty years later, the position of Black people in America has genuinely improved  a low bar  and contrary to Baldwins own predictions, America has seen its first Black president, a charismatic centrist who forcefully rejected the idea that racial division is inherent to America. But the question of so-called social justice  the idea that certain identity groups are wronged by the unequal distribution of social status  remains hotly contested today. That this idea has achieved a degree of cultural penetration is undeniable: When the right complains about woke Hollywood, it is not talking about nothing. But it is tricky to define social justice further without stuffing more straw into a straw man. Today the phrase is most often derogatory in tone; those who still speak unironically of social justice are generally publicists, consultants, and resistance grifters on Instagram. The mythic social-justice warrior  the woke, self-righteous, hypersensitive moralist who bathes in the blood of the canceled  is so caricatured at this point that one struggles to know how much of its imputed content is rooted in reality. What we can say is that the influence of social justice, whether real or perceived, was supercharged by the election of Donald Trump, a shameless if unideological racist whose authoritarian impulses made the idea of a societywide system of white supremacy increasingly plausible. Perhaps no instance of social justice looms larger in the popular imagination than the summer of 2020, when the murder of George Floyd by Minneapolis police provoked protests and riots across the country at the height of the pandemic. The demonstrations, some of the largest in American history, recalled the long hot summer of 1967, when protesters whose lives had only been meagerly improved by recent civil-rights legislation ransacked storefronts in Newark and Detroit. Now photographs of a blazing liquor store in Minneapolis and club-wielding police officers in gas masks signified for some a renewed spirit of uprising and for others a lawless threat to democracy. (In fact, the vast majority of protests were nonviolent.) But the revolt was not a revolution, outside a short-lived autonomous zone in Seattle and some nominal budget reforms that fell short of defunding the police. What the nation got instead was a reorganization of the professional classes. Major corporations and cultural institutions took the opportunity to proclaim their commitment to social justice, installing new diversity-equity-and-inclusion programs. Anti-racist reading lists circulated online while prominent journalists and media figures lost their jobs over alleged micro-aggressions in the workplace. Congressional Democrats introduced their police-reform act by donning kente stoles and kneeling ridiculously in the Capitol. (What did not happen, we know now, was fewer killings by police.) Critics of social justice sensed an opening. Later that summer, Harpers magazine published an open letter warning that the ongoing unrest was weakening liberal norms of tolerance and free thinking in favor of ideological conformity. The letter, whose high-profile signatories ranged from Noam Chomsky to J. K. Rowling, ruffled all of the intended feathers, even if its successful brandishing of elite influe..."},{"id":"node_14","title":"“Please Keep Caring.” What John McPhee Taught Generations of Writers and Journalists","url":"https://lithub.com/please-keep-caring-what-john-mcphee-taught-generations-of-writers-and-journalists/","cluster":2,"position":{"x":9.37354564666748,"y":4.269964694976807},"keywords":["Craft and Criticism Literary Criticism Craft","the Novel Poem News","nonfiction writing","The Critic and Her Publics Windham-Campbell Prizes Podcast Memoir Nation","Poetry Short Story"],"content_preview":"Literary Hub Craft and Criticism Literary Criticism Craft and Advice In Conversation On Translation Fiction and Poetry Short Story From the Novel Poem News and Culture History Science Politics Biograp...","content":"Literary Hub Craft and Criticism Literary Criticism Craft and Advice In Conversation On Translation Fiction and Poetry Short Story From the Novel Poem News and Culture History Science Politics Biography Memoir Food Technology Bookstores and Libraries Film and TV Travel Music Art and Photography The Hub Style Design Sports Lit Hub Radio The Lit Hub Podcast Awakeners FictionNonFiction The Critic and Her Publics Windham-Campbell Prizes Podcast Memoir Nation Beyond the Page First Draft: A Dialogue on Writing Thresholds The Cosmic Library Culture Schlock Reading Lists The Best of the Decade Book Marks Best Reviewed Books CrimeReads True Crime The Daily Thrill Log In Craft and Criticism Literary Criticism Craft and Advice In Conversation On Translation Fiction and Poetry Short Story From the Novel Poem News and Culture History Science Politics Biography Memoir Food Technology Bookstores and Libraries Film and TV Travel Music Art and Photography The Hub Style Design Sports Lit Hub Radio The Lit Hub Podcast Awakeners FictionNonFiction The Critic and Her Publics Windham-Campbell Prizes Podcast Memoir Nation Beyond the Page First Draft: A Dialogue on Writing Thresholds The Cosmic Library Culture Schlock Reading Lists The Best of the Decade Book Marks Best Reviewed Books CrimeReads True Crime The Daily Thrill Log In Please Keep Caring. What John McPhee Taught Generations of Writers and Journalists Peter Hessler on a Beloved Mentor and Tireless Proponent of Creative Nonfiction Via Princeton University Press Peter Hessler May 19, 2025 In the spring of 1991, when I was a junior at Princeton, I took John McPhees seminar on nonfiction writing. Back then, I was an English major who hoped to become a novelist, and I focused primarily on writing short stories. I had no real interest in nonfiction. I hadnt published a single word in any campus publication, and I had never considered a career in journalism. But John McPhees course was famous for having produced authors, and writingin the undisciplined, impractical, and insecure dreamworld of a 21-year-old mindwas what I hoped to do someday. So I signed up for the class.Article continues after advertisement By the time I arrived for the first session, in a beautiful, wood-paneled room on the ground floor of a gothic building called East Pyne Hall, the only piece of John McPhees writing that I had ever read was the course description. In retrospect, I find this mortifying. But it was also characteristic of the 21-year-old dreamworld: everything was of the moment; nothing was carefully considered. One might assume that, before taking a course taught by John McPhee, who had been described by The Washington Post as the best journalist in America, a student would feel inspired to read a couple of books or maybe even one magazine article by John McPhee. But this idea apparently never occurred to me. Everywhere I went, I heard echoes of East Pyne. Please keep caring on the pieces to come. As a result, I first became a McPhee reader in the margins of the essays that I submitted for class. He marked every paper in pencil, in a tight left-handed script. He crossed out words, and he drew boxes around phrases, and he inscribed long comments that sometimes ran perpendicular to the text. You cant make a silk purse out of this, he wrote, in response to one of my poorly executed descriptions. Next to a sentence with oddly formal phrasing, he remarked, This could be said with several pebbles removed from the mouth. Once, when I used a subjects name four times in the span of two sentences, McPhee wrote, Listen to the characters name thudding like horseshoes. Vary it. Use pronouns here and there. Other comments thudded in a way that made horseshoes seem soft:Article continues after advertisement This sort of thing is irritatingly repetitive. The incongruity in this line isnt artful, its just awkward. I wish you would listen more critically to the rhythms and sound of the prose. You are extraordinarily repetitive for someone who writes on your level. This is lame cleverness.Article continues after advertisement But there were also many instances of praise, when John McPhee wrote in the margins yes, or ah, or a fine moment. At the end of my first paper, the neatly penciled script sent up sparks of encouragement: This piece is a pleasureinsightfully imagined and ably wrought It took careplease keep caring on the pieces to come. I realized that its possible to write both very well and very badly at the same time. My project was to learn how to do the one without the other, and every two weeks, as part of the course, I had an hour-long one-on-one tutorial with John McPhee in his office, on the top floor of East Pyne. That semester, I finally became a proper McPhee reader: for class, he photocopied sections of his books and talked in detail about various problems he had encountered and decisions he had made. While studying his prose we learned about structure, set pieces, and transitions that felt effor..."},{"id":"node_15","title":"William Jones (philologist) - Wikipedia","url":"https://en.wikipedia.org/wiki/William_Jones_(philologist)","cluster":2,"position":{"x":8.952031135559082,"y":5.3620147705078125},"keywords":["Sir William Jones","Welsh mathematician William Jones","m. 1783)ParentWilliam Jones","The young William Jones","Sir Joshua ReynoldsPuisne judge"],"content_preview":"From Wikipedia, the free encyclopedia British scholar and judge (17461794) SirWilliam JonesFRS FRAS FRSEA steel engraving of Sir William Jones, after a painting by Sir Joshua ReynoldsPuisne judge of t...","content":"From Wikipedia, the free encyclopedia British scholar and judge (17461794) SirWilliam JonesFRS FRAS FRSEA steel engraving of Sir William Jones, after a painting by Sir Joshua ReynoldsPuisne judge of the Supreme Court of Judicature at Fort William in BengalIn office22 October 1783[1]  27 April 1794[2] Personal detailsBorn(1746-10-09)9 October 1746[3]Westminster, LondonDied27 April 1794(1794-04-27) (aged 47)Calcutta, Bengal PresidencyResting placeSouth Park Street CemeterySpouse Anna Maria Shipley (m. 1783)ParentWilliam Jones (father) Sir William Jones FRS FRAS FRSE (28 September 1746  27 April 1794) was a Welsh scholar and judge. Born in Westminster, London to Welsh mathematician William Jones, he moved to the Bengal Presidency where Jones served as a puisne judge on the Supreme Court of Judicature at Fort William and also became a scholar of ancient Indian history. As part of his research, he was the first to assert the kinship of the Indo-European languages. Jones also founded the Asiatic Society in Calcutta in 1784. Early life[edit] William Jones was born in London; his father William Jones (16751749) was a mathematician from Anglesey in Wales, noted for introducing the use of the symbol π. The young William Jones was a linguistic prodigy, who in addition to his native languages English and Welsh,[4] learned Greek, Latin, Persian, Arabic, Hebrew and the basics of Chinese writing at an early age.[5] By the end of his life, he knew eight languages with critical thoroughness.[6] Joness father died when he was aged three, and his mother Mary Nix Jones raised him. He was sent to Harrow School in September 1753 and then went on to University College, Oxford. He graduated there in 1768 and became M.A. in 1773. Financially constrained, he took a position tutoring the seven-year-old Lord Althorp, son of Earl Spencer. For the next six years, he worked as a tutor and translator. During this time he published in 1770 Histoire de Nader Chah (History of Nader Shah), a French translation of a work originally written in Persian by Mirza Mehdi Khan Astarabadi. This was done at the request of King Christian VII of Denmark: he had visited Jones, who by the age of 23 had already acquired a reputation as an orientalist, and in appreciation of his work he was granted membership in the Royal Danish Academy of Sciences and Letters.[7] This would be the first of his numerous works on Persia, Anatolia, and the Middle East in general. Tomb of William Jones in South Park Street Cemetery, Kolkata. Legal studies and politics in England[edit] In 1770, Jones joined the Middle Temple and studied law for three years, a preliminary to his life-work in India. He was elected a Fellow of the Royal Society on 30 April 1772.[8] In 1773, he was elected a member of The Club, of which he became president in 1780.[9] He spent some time as a circuit judge in Wales, and then became involved in politics: he made a fruitless attempt to resolve the American Revolution in concert with Benjamin Franklin in Paris,[10] and ran for the post of Member of Parliament from Oxford in the general election of 1780, but was unsuccessful.[11] Jones was a radical political thinker, and a friend of American independence. His work, The principles of government; in a dialogue between a scholar and a peasant (1783), was the subject of a trial for seditious libel (known as the Case of the Dean of St Asaph)[12] after it was reprinted by his brother-in-law William Davies Shipley.[13] Indian tenure[edit] He was appointed puisne judge to the Supreme Court of Judicature at Fort William in Calcutta, Bengal, on 4 March 1783, and on 20 March he was knighted. In April 1783 he married Anna Maria Shipley, the eldest daughter of Jonathan Shipley, Bishop of Llandaff and Bishop of St Asaph. Anna Maria used her artistic skills to help Jones document life in India. On 25 September 1783, he arrived in Calcutta. In the Subcontinent he was entranced by Indian culture, an as-yet untouched field in European scholarship, and on 15 January 1784 he founded the Asiatic Society in Calcutta.[14] He studied the Vedas with Rāmalocana, a pandit teaching at the Hindu University of Nadiya, becoming a proficient Sanskritist.[14] Jones kept up a ten-year correspondence on the topic of jyotisa or Hindu astronomy with fellow orientalist Samuel Davis.[15] He learnt the ancient concept of Hindu Laws from Pandits. Over the next ten years, he produced a flood of works on India, launching the modern study of the subcontinent in virtually every social science. He also wrote on the Hindu and Muslim laws, music, literature, botany, and geography, and made the first English translations of several important works of Indian literature.[16] Sir William Jones sometimes also went by the nom de plume Youns Uksfardi (یونس اوکسفردی, Jones of Oxford). This pen name can be seen on the inner front cover of his Persian Grammar published in 1771 (and in subsequent editions). Joness works, especially his translations, with their ..."},{"id":"node_16","title":"Dagwood Bumstead - Wikipedia","url":"https://en.wikipedia.org/wiki/Dagwood_Bumstead","cluster":0,"position":{"x":10.451215744018555,"y":1.9824295043945312},"keywords":["Comics character Dagwood BumsteadDagwood Bumstead","Young Dagwood Bumstead","Chic Youngs long-time friend Arthur Bumstead","The Bumsteads first baby","the title character Blondie née Boopadoop"],"content_preview":"From Wikipedia, the free encyclopedia Comics character Dagwood BumsteadDagwood Bumstead and his Dagwood sandwichPublication informationPublisherKing Features SyndicateFirst appearanceSeptember 8, 1930...","content":"From Wikipedia, the free encyclopedia Comics character Dagwood BumsteadDagwood Bumstead and his Dagwood sandwichPublication informationPublisherKing Features SyndicateFirst appearanceSeptember 8, 1930Created byChic Young Dagwood Bumstead is a main character in cartoonist Chic Youngs long-running comic strip Blondie. He debuted in the first strip on September 8, 1930. He was originally heir to the Bumstead Locomotive fortune, but was disowned when he married the title character Blondie née Boopadoop, a flapper whom his family saw as below his class. He has since worked hard at J. C. Dithers Construction Company as office manager to support his family. The Bumsteads first baby, Alexander, was originally named Baby Dumpling. The name of his daughter, Cookie, was chosen by readers in a national contest. The family circle is rounded out by Daisy the dog.[1] The origin of both Dagwoods last name and Daisys name came from Chic Youngs long-time friend Arthur Bumstead and his dog, Daisy.[2] Characteristics[edit] His favorite things in life include his wife Blondie, his kids, naps on the sofa, long baths, and food. Dagwood is famous for concocting tall, multilayered sandwiches topped with an olive on a toothpick, and the term Dagwood sandwich has entered American English. Dagwood often made these sandwiches late at night. Dagwood frequently has problems with door-to-door salesmen, rude telemarketers and store salespeople, crashing into the mailman (Mr. Beasley) as he rushes from home, getting ready before the carpool leaves without him, getting to work on time, his boss J.C. Dithers, and Cookies many dates. He is often suspicious of her dates and keeps a close watch on them when they come to the house. Other characters in his universe include Elmo Tuttle, a pesky little neighborhood kid who wanders in and out of the Bumstead house; next-door neighbors Herb and Tootsie Woodley; Lou, the sarcastic cook in a local diner; and Mr. Dithers domineering wife, Cora. Dagwoods birthday is July 20, or April 21, or February 15.[3][4] Appearances in other media[edit] Over the years, Dagwood has appeared not only in daily newspapers, but also in comic books, Big Little Books, Whitman novels for children and other print materials, as well as radio, film, and television. Arthur Lake played Dagwood in the Blondie film series (193850), radio series and the short-lived 1957 TV series. Hal Le Roy portrayed Dagwood in the pilot for the 1957 series. Will Hutchins played him in the 1968 TV series. He made several cameo appearances in Garfield Gets Real, alongside Grimmy from Mother Goose and Grimm. Dagwood and his wife also made a cameo appearance in a Garfield strip originally published April 1, 1997. In a fourth wall break, Garfield refers to this as moving to a different comic strip.[5] Dagwood made another appearance in Garfield comic strips on August 20, 2005, to invite Jon and Garfield for Blondie and his anniversary party. Dagwood also made a cameo appearance in the 1946 cartoon Hollywood Canine Canteen, where his wife Blondie and he (named Dogwood in this short) are portrayed as anthropomorphic dogs working in a snack bar. Penny Singleton and Arthur Lake voiced these characters, respectively. In the song Homemade Mummy, alternative rapper Aesop Rock briefly refers to Dagwood.[6] References[edit]  Blondie and Dagwood  comic strip characters. Encyclopedia Britannica. Retrieved 2019-07-20.  Comics Kingdom - Blondie. www.comicskingdom.com. Retrieved 2019-07-20.  Blondie for 4212020. ArcaMax. Retrieved 2020-04-21.  Blondie for 2152025. ArcaMax. Retrieved 2025-02-15.  Garfield  Friends. garfield.com. Retrieved 2019-07-20.  Aesop Rock  Homemade Mummy, retrieved 2019-07-20 vteBlondie created by Chic Young Dagwood Bumstead Dagwood sandwich Cartoonists Stan Drake Mike Gersher Denis Lebrun John Marshall Jim Raymond Dean Young AdaptationsFilms Blondie (1938) Blondie Meets the Boss (1939) Blondie Takes a Vacation (1939) Blondie Brings Up Baby (1939) Blondie on a Budget (1940) Blondie Has Servant Trouble (1940) Blondie Plays Cupid (1940) Blondie Goes Latin (1941) Blondie in Society (1941) Blondie Goes to College (1942) Blondies Blessed Event (1942) Blondie for Victory (1942) Its a Great Life (1943) Footlight Glamour (1943) Leave It to Blondie (1945) Life with Blondie (1946) Blondies Lucky Day (1946) Blondie Knows Best (1946) Blondies Big Moment (1947) Blondies Holiday (1947) Blondie in the Dough (1947) Blondies Anniversary (1947) Blondies Reward (1948) Blondies Secret (1948) Blondies Big Deal (1949) Blondie Hits the Jackpot (1949) Blondies Hero (1950) Beware of Blondie (1950) Radio Blondie (1939-1950) Television Blondie (1957 series) Blondie (1968 series) Popeye Meets the Man Who Hated Laughter (1972 special) Actors Arthur Lake Penny Singleton Related King Features Syndicate Retrieved from https:en.wikipedia.orgwindex.php?titleDagwood_Bumsteadoldid1296008929 Categories: American comics charactersBlondie (comic strip)Comics characters introduced i..."},{"id":"node_17","title":"Shadow of a Doubt","url":"https://harpers.org/archive/2025/07/shadow-of-a-doubt-ocd-andrew-kay/","cluster":0,"position":{"x":9.889127731323242,"y":2.6923444271087646},"keywords":["the twenty-eighth Annual OCD Conference","contamination ocd","violent harm ocd","sexuality ocd","distressing thoughts"],"content_preview":"July 2025 Issue [Report] Shadow of a Doubt How OCD came to haunt American life by Andrew Kay, Illustrations by Tomasz Wozniakowski [Report] Shadow of a Doubt How OCD came to haunt American life by And...","content":"July 2025 Issue [Report] Shadow of a Doubt How OCD came to haunt American life by Andrew Kay, Illustrations by Tomasz Wozniakowski [Report] Shadow of a Doubt How OCD came to haunt American life by Andrew Kay, Adjust Share Listen to an audio version of this article. I want yall to walk to the sign that represents the kind of OCD you most identify with, announces the moderator, a young woman named Angie Bello who sits cross-legged on the carpet and whose service doodle, Sully, has docked his submarine snout in her lap. Around the room, volunteers hoist placards that say things like violent harm ocd, sexuality ocd, and contamination ocd. They smile benignly, and for an instant all one hundred of uspeople ranging from twenty to seventy, joined by nothing but a particular kind of madnessstand frozen, a forest of amygdalas flaring. Outside, San Francisco at dusk: Bob Ross clouds in haphazard sweepings of pink and feathered gray and, darkening beneath them, the city itself, garishly beautiful and troubled. We are in an upstairs conference room at the Marriott Marquis, a fortress of cleanliness and order acceptable even to the most afflicted among us. This is the icebreaker on the first full day of the twenty-eighth Annual OCD Conference in July 2023, a global summit marshaling together hundreds with the illness and, alongside them, therapists who treat it and researchers who endeavor to grasp it. OCD, which swarms people with distressing thoughts and drives them to seek relief in life-consuming rituals, is an isolating and often secret condition; it is not, generally speaking, a thing one puts in a Hinge profile or drops over daiquiris. But this weekend, we are repeatedly reminded, is about shattering the stigma. It is also the first full-blown OCD Conference since COVID-19, and because that calamity hit many in this crowd with especial forcebecause, as one man will tell me, everything wed always feared was finally happeningit feels historic. I walk to contamination ocd, passing several goggle-eyed souls clustered tensely beneath violent harm. Im late arriving: a sweet, spectacled computer programmer is describing his phobias of rabies and AIDS. If I spot markings on anything in my apartmentgroceries, furnituremy brain decides theyre bite marks, like by a bat, and even if I just bought it I have to toss it. Everyone nods; encouraged, he goes on. Sometimes I think about how recent all this is. Like, humans havent even known about germs for that long! Kellie, a slender woman of twenty-four, chimes in: I sometimes feel like my various forms of OCD are at war. My contamination OCD forces me to shower, but then showering triggers my BDD. Body dysmorphic disorder, sometimes thought to be a form of OCD, torments people with an illusion of physical defects. So, as a teen, Kellie became convinced something was wrong with her faceinvisible to everyone else but to her as incontrovertible as the blueness of the sky. She would miss school, mesmerized by the bathroom mirror; believing she looked subhuman and plagued, too, by contamination dread, she took to drinking peroxide. At last, suicidal, Kellie checked into McLean Hospital in Massachusetts, undergoing exposure and response prevention therapy (ERP), the gold standard in OCD treatment, whereby patients incrementally confront the source of their fear and are barred from performing their rituals. Clinicians took photos of her, blew them up, and hung them from the walls of the kitchen for all to see while they ate, alongside signed declarations by other patients attesting to their intrusive thoughts (things like I want to do a dog. Sincerely, James Lee). It worked: she wrested control of her life, moved to San Francisco, and, belatedly, enrolled in college. Hows yours manifest? someone asks. All are peering at me. Breath stuff, I say coolly. Airborne contamination stuff through my mouth, my eyes. Identity stuff. Since I was a boy, I have suffered from a kind of OCD driven, at bottom, by what I once described to a therapist as a fear of self-loss. There were people in my childhood orbit whose volatility gave life the feel of being perched on a tectonic rift. I grew afraid of becoming themavoided looking at their pictures so I wouldnt absorb their essence, held my breath when they walked by, frightened of inhaling their wake. In time the scope of my fear widened to encompass more and more people whom I deemed monstrous. I became a kind of anti-Proteus, hell-bent on safeguarding my self. By nine Id devised a private religion, with strange mantras and rules so severe that Calvin would have dismissed them as fucked up. Having done something objectionable, I went off in secret to repeat Scratch that from the record over and over, and apologized to God. Time! Bellos voice rings out, astonishing the room. You were all so vulnerable just now. Give yourselves a pat on the back for being vulnerable. I look about me at wizened adults with, I imagine, paid-off mortgages, wills, and Roth I..."},{"id":"node_18","title":"The Cultural Decline of Literary Fiction","url":"https://oyyy.substack.com/p/the-cultural-decline-of-literary?r=1yuzf&utm_campaign=post&utm_medium=web&triedRedirect=true","cluster":2,"position":{"x":9.350337028503418,"y":4.190562725067139},"keywords":["American literary fictions cultural impact","the literary men","the literary (straight) (white) male","virtually all young contemporary literary fiction writers","Literary FictionWhat"],"content_preview":"The Cultural Decline of Literary FictionWhat happened?Owen YinglingJun 14, 2025561201143ShareRecently, there has been a lot of talk about the decline of the literary (straight) (white) male. The margi...","content":"The Cultural Decline of Literary FictionWhat happened?Owen YinglingJun 14, 2025561201143ShareRecently, there has been a lot of talk about the decline of the literary (straight) (white) male. The marginal benefit provided by an additional take on this topic, some clever new angle walking the tightrope between edgy and politically correct, is rapidly approaching zero.The problem with these articlesand the discourse as a wholeis that none of them go far enough. There is an impassable chasm between the stardom of Mailer, Updike, McCarthy, DFW, Franzen, etc and whoever is getting fellowships and is published in The New Yorker or Paris Review today. Yet the chief complaint from advocates for the literary men is that they are unfairly denied these fellowships and publications. Im sure theyre being discriminated against, but youre just replacing one group of people youve never heard of, with a different group of people youve never heard of with different sex organs.This may well be a Title VII problem, but theres a bait-and-switch happening: the rhetorical appeal of the conversation about literary men depends on the fall-off from The Greatsthe juxtaposition between their success and the barren opportunities for literary men today. Yet no one seems willing to contend with the fact that this is not just an issue for literary men, its an issue for everyone. What non-identity quality do The Greats have in common that virtually all young contemporary literary fiction writers (Rooney aside), dont? Its obviouspeople knew about them and bought their books.1The 21st century collapse in American literary fictions cultural impact, measured by commercial sales and the capacity to produce well-known great writers, stems less from identity politics or smartphones than from a combined supply shock (the shrinking magazine or academia pipeline) and demand shock (the move away from writing books that appeal to normal readers in order to seek prestige inside the world of lit-fiction)To start, take a look at Publisher Weeklys list of best-selling novels of 1962:Ship of Fools by Katherine Anne PorterDearly Beloved by Anne Morrow LindberghA Shade of Difference by Allen DruryYoungblood Hawke by Herman WoukFranny and Zooey by J. D. SalingerHeres 1963:The Shoes of the Fisherman by Morris WestThe Group by Mary McCarthyRaise High the Roof Beam, Carpenters, and Seymour-An Introduction by J. D. SalingerCaravans by James A. MichenerElizabeth Appleton by John OHaraIt feels a little cruel to rub it in, but for comparisons sake heres 2023:It Ends with Us by Colleen HooverIt Starts with Us by Colleen HooverFourth Wing by Rebecca YarrosAtomic Habits by James Clear2Dog Man: Twenty Thousand Fleas Under the Sea by Dav PilkeySome miscellaneous facts:Portnoys Complaint was the best-selling book of 1969James Joness From Here to Eternity (861 pages) was the best-selling book of 1951Lolita made it to 3 in 1958 and held on at 8 in 1959 (the 1 spot in 1958 belonged to Doctor Zhivago)Ragtime was the best-selling book of 1975The Corrections  5 in 2001  was the most recent work of literary fiction to make the yearly top ten best-sellersNo work of literary fiction has been on Publishers Weeklys yearly top ten best-selling list since 2001 (Unfortunately when I first wrote this I missed that Franzen appears once more at 8 in 2010 with Freedom)Percival Everetts James is the most recent work of literary fiction to make the New York Timess weekly bestseller list  it was the best-selling book in the last week of 2024Before James, the most recent one was Amor Towless The Lincoln Highway for one week in October 2021In the mad rush for stability among a shrinking pool of resources (financial and cultural), authors and discourse-makers seem to have fallen into malaise bickering about how these resources should be divided up instead of why the pool is shrinking. It doesnt matter that no white man born after 1984 has been published by The New Yorker, because I honestly doubt any serious reader of fiction could easily bring to mind a short story by any younger writer in The New Yorker at all. The gap between now and The Greats matters for all writers, not just men. So the real problem is literary fictions wholesale decline, not how the ever-smaller pie gets sliced up.After reading some articles on the decline of American literary fiction, I came away with the sense that no one is particularly interested in why literary fictions relevance has plummeted, instead the authors of these pieces are intent on proving only whether or not salient issues like smartphones, discrimination, or woke publishers might have something to do with it. But while its not difficult to cobble together a story about why these issues might have had some effect, no one has bothered to ask whether these are really the driversif they drive the discourse, surely theyre the actual causes right?Lets look at two representative articles that touch on the general decline of literary fiction: Will Blythes The Li..."},{"id":"node_19","title":"The Strange Undeath of Middlebrow","url":"https://hedgehogreview.com/issues/who-do-we-think-we-are/articles/the-strange-undeath-of-middlebrow?utm_source=substack&utm_medium=email","cluster":2,"position":{"x":10.344659805297852,"y":4.131413459777832},"keywords":["the three brow-words","the brow ridges","Saxon skulls","pureblooded Anglo-Saxon gentlemen","the three -brow suffixes"],"content_preview":"It is odd that anyone still uses the word middlebrow. Like its complements lowbrow and highbrow, it reeks of antique beliefs, specifically the English notion that the brow ridges of pureblooded Anglo-...","content":"It is odd that anyone still uses the word middlebrow. Like its complements lowbrow and highbrow, it reeks of antique beliefs, specifically the English notion that the brow ridges of pureblooded Anglo-Saxon gentlemen jut out and up in a most lordly fashion.11xThe earliest print use I could find of any of the three brow-words, in the Oxford English Dictionary, was George Eliots reference to gentle maidens and high-browed, brave men in an 1848 letter. Eliots interest in phrenology is well-attested, but as recently as 1939 one could find a Harvard anthropologist assuring his readers that Saxon skulls lack the low vault and sloping forehead common to the earlier Nordics of Denmark, and that compared with the other Nordics, the forehead is relatively straight [and] the browridges are greater. See Carleton Stephens Coon, The Races of Europe (New York, NY: Macmillan, 1939), 207. It is ill defined, sometimes functioning as an insult, sometimes as a compliment, and sometimes as an ostensibly neutral modifier. The faintly clumsy rhythm of its syllables, the physicality of the image it describes combined with the difficulty of actually picturing itwe have to quickly imagine a whole range of brow placements, then select a spot within that rangeleave the impression of something absurd and not quite real. But what is strangest about the terms survival is that it would seem to have no purpose. We mainly use the three -brow suffixes to rank cultural products somewhere in the middle of an agreed-upon hierarchy of taste. It is far from clear that such a hierarchy still exists. In my experience, teachers of the humanities, museum curators, arts journalists, and artists themselvesthe people whose job it would be to maintain such a hierarchyare far likelier to disclaim it than affirm it. There are still reputations, in the simple sense that many people have heard the name Shakespeare, somewhat fewer have heard the name August Wilson, and very few have heard the name Paul Green.22xThis is not to deny that artistic reputations are shaped by social structures, as they are by many things. For a helpfully nuanced account of artistic reputation and the idea of literary canons, see Samuel Delany, About Writing: Seven Essays, Four Letters, and Five Interviews (Middletown, CT: Wesleyan University Press, 2005), 337374. (He won the Pulitzer Prize for drama in 1927.) So local theater companies continue to present A Midsummer Nights Dream and, less often, Fences, just as regional orchestras continue to program Beethovens Fifth Symphony and Barbers Adagio for Strings. But what happens if you ask the director of one of those local theater companies, or the percussionist of one of those regional orchestras, whether tragedy or classical music is an inherently worthier form than, say, comic strips? Whatever their feelings, they will remember that scrap of Pierre Bourdieu that someone forced them to read in collegefor he, too, is canonicaland say No. (We will leave aside, as this conversation generally does, the vexing questions of what inherent and great mean or could possibly mean in this context.) If pressed, they will say that the works that embody these traditions remain important because, due to a once common but mistaken belief in their inherent worth, they have influenced the culture. In other words, these works value comes from the fact that misguided people once valued them. Not a ringing defense. The most eloquent and thoughtful such culture workers might make a case on the basis of the qualities of the particular works in question. As they spoke, a bureaucrat somewhere would be eyeing a line item, and reaching for a marker. Modern Middlebrow Everything that was once considered lowbrow is now triumphant. It is still common for people to talk of guilty cultural pleasuresTV, dance musicabout which no one has felt guilty in decades, and to apologize for them with an enthusiasm that looks a lot like pride. But the pretense of guilt is merely there to increase our pleasure; it adds the excitement of transgression to an otherwise banal activity. Successful artists in lowbrow forms now live in the perpetual snit of offended dignity that used to mark a person as a member of the highbrow avant-garde. Recently, a pop stara rich person, her work fawned over by criticspublicly attacked a well-respected reviewer over a (mainly positive) review of her new record. Also recently, a wealthy, famous author of books for teenage girls engaged in a public feud with a woman student who had, in a college newspaper, described that authors books, accurately, as books for teenage girls. Several other wealthy, famous authors joined into further humiliate the offending student. Artists used to have the decency to conduct such bullying via backchannels: An agent makes a discreet phone call to the offices of Rolling Stone, and a freelancer disappears from its roster. Todays popular artists dont scruple to perform these offenses to their own dignity in public. They s..."},{"id":"node_20","title":"Brokeback Mountain","url":"https://www.newyorker.com/magazine/1997/10/13/brokeback-mountain","cluster":1,"position":{"x":10.538740158081055,"y":2.6364011764526367},"keywords":["Ennis","Enniss case","Ranch Employmentthey","a two-mortgage ranch","ranch work"],"content_preview":"Save this storySave this storySave this storySave this storyThey were raised on small, poor ranches in opposite corners of the state, Jack Twist in Lightning Flat, up on the Montana border, Ennis del ...","content":"Save this storySave this storySave this storySave this storyThey were raised on small, poor ranches in opposite corners of the state, Jack Twist in Lightning Flat, up on the Montana border, Ennis del Mar from around Sage, near the Utah line, both high-school drop-out country boys with no prospects, brought up to hard work and privation, both rough-mannered, rough-spoken, inured to the stoic life. Ennis, reared by his older brother and sister after their parents drove off the only curve on Dead Horse Road, leaving them twenty-four dollars in cash and a two-mortgage ranch, applied at age fourteen for a hardship license that let him make the hour-long trip from the ranch to the high school. The pickup was old, no heater, one windshield wiper, and bad tires; when the transmission went, there was no money to fix it. He had wanted to be a sophomore, felt the word carried a kind of distinction, but the truck broke down short of it, pitching him directly into ranch work.In 1963, when he met Jack Twist, Ennis was engaged to Alma Beers. Both Jack and Ennis claimed to be saving money for a small spread; in Enniss case that meant a tobacco can with two five-dollar bills inside. That spring, hungry for any job, each had signed up with Farm and Ranch Employmentthey came together on paper as herder and camp tender for the same sheep operation north of Signal. The summer range lay above the tree line on Forest Service land on Brokeback Mountain. It would be Jack Twists second summer on the mountain, Enniss first. Neither of them was twenty.They shook hands in the choky little trailer office in front of a table littered with scribbled papers, a Bakelite ashtray brimming with stubs. The venetian blinds hung askew and admitted a triangle of white light, the shadow of the foremans hand moving into it. Joe Aguirre, wavy hair the color of cigarette ash and parted down the middle, gave them his point of view.Forest Service got designated campsites on the allotments. Them camps can be a couple a miles from where we pasture the sheep. Bad predator loss, nobody near lookin after em at night. What I wantcamp tender in the main camp where the Forest Service says, but the herderpointing at Jack with a chop of his handpitch a pup tent on the Q.T. with the sheep, out a sight, and hes goin a sleep there. Eat supper, breakfast in camp, but sleep with the sheep, hundred percent, no fire, dont leave no sign. Roll up that tent every mornin case Forest Service snoops around. Got the dogs, your .30-.30, sleep there. Last summer had goddam near twenty-five-percent loss. I dont want that again. You, he said to Ennis, taking in the ragged hair, the big nicked hands, the jeans torn, button-gaping shirt, Fridays twelve noon be down at the bridge with your next-week list and mules. Somebody with suppliesll be there in a pickup. He didnt ask if Ennis had a watch but took a cheap round ticker on a braided cord from a box on a high shelf, wound and set it, tossed it to him as if he werent worth the reach. Tomorrow mornin well truck you up the jump-off. Pair of deuces going nowhere.They found a bar and drank beer through the afternoon, Jack telling Ennis about a lightning storm on the mountain the year before that killed forty-two sheep, the peculiar stink of them and the way they bloated, the need for plenty of whiskey up there. At first glance Jack seemed fair enough, with his curly hair and quick laugh, but for a small man he carried some weight in the haunch and his smile disclosed buckteeth, not pronounced enough to let him eat popcorn out of the neck of a jug, but noticeable. He was infatuated with the rodeo life and fastened his belt with a minor bull-riding buckle, but his boots were worn to the quick, holed beyond repair, and he was crazy to be somewhere, anywhere, else than Lightning Flat.Ennis, high-arched nose and narrow face, was scruffy and a little cave-chested, balanced a small torso on long, caliper legs, and possessed a muscular and supple body made for the horse and for fighting. His reflexes were uncommonly quick, and he was farsighted enough to dislike reading anything except Hamleys saddle catalogue.The sheep trucks and horse trailers unloaded at the trailhead, and a bandy-legged Basque showed Ennis how to pack the mulestwo packs and a riding load on each animal, ring-lashed with double diamonds and secured with half hitchestelling him, Dont never order soup. Them boxes a soup are real bad to pack. Three puppies belonging to one of the blue heelers went in a pack basket, the runt inside Jacks coat, for he loved a little dog. Ennis picked out a big chestnut called Cigar Butt to ride, Jack a bay mare that turned out to have a low startle point. The string of spare horses included a mouse-colored grullo whose looks Ennis liked. Ennis and Jack, the dogs, the horses and mules, a thousand ewes and their lambs flowed up the trail like dirty water through the timber and out above the tree line into the great flowery meadows and the coursing..."},{"id":"node_21","title":"List of old-growth forests - Wikipedia","url":"https://en.wikipedia.org/wiki/List_of_old-growth_forests","cluster":4,"position":{"x":7.629327774047852,"y":4.810033798217773},"keywords":["Uganda Country Area Old-growth extent WWF ecoregion Old-growth forest type Democratic Republic","old-growth forests","existing old-growth forest","Salonga National Park Central Congolian lowland forests","Terrestrial Ecoregions"],"content_preview":"From Wikipedia, the free encyclopedia This list is incomplete; you can help by adding missing items. (August 2008) This article needs additional citations for verification. Please help improve this ar...","content":"From Wikipedia, the free encyclopedia This list is incomplete; you can help by adding missing items. (August 2008) This article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.Find sources: List of old-growth forests  news  newspapers  books  scholar  JSTOR (June 2024) (Learn how and when to remove this message) Redwood trees at Muir Woods National Monument, California This is a list of areas of existing old-growth forest which include at least 10 acres (4.0 hectares) of old growth. Ecoregion information from Terrestrial Ecoregions of the World.[1] (NB: The terms old growth and virgin may have various definitions and meanings throughout the world. See old-growth forest for more information.) Africa[edit] This section needs expansion. You can help by adding to it. (January 2010) Bwindi Impenetrable Forest, Uganda Country Area Old-growth extent WWF ecoregion Old-growth forest type Democratic Republic of the Congo Salonga National Park Central Congolian lowland forests Réunion (France) Réserve biologique intégrale du Bois des Nèfles 179 hectares (440 acres) Tropical and subtropical dry broadleaf forests Réunion (France) Réserve biologique intégrale du Piton de la Fournaise 21,005 hectares (51,900 acres) Tropical and subtropical moist broadleaf forests Réunion (France) Réserve biologique intégrale du Mazerin 2,491 hectares (6,160 acres) Tropical and subtropical dry broadleaf forests Pandanus scrub Kenya Kakamega Forest[citation needed] Asia[edit] This section needs expansion. You can help by adding to it. (June 2024) Gunung Leuser National Park, Indonesia Yakushima, Japan Country Area Old-growth extent WWF ecoregion Old-growth forest type Bangladesh and India Sundarbans Sundarbans Mangrove forest Cambodia Prey Lang Tropical and subtropical dry broadleaf forests Georgia Kintrishi Protected Landscape Euxine-Colchic deciduous forests temperate broadleaf rainforest Georgia Lagodekhi Protected Areas Caucasus mixed forests temperate broadleaf forest Georgia Mtirala National Park Euxine-Colchic deciduous forests temperate broadleaf rainforest India Dudhatoli Mountains, Uttarakhand 6,000 hectares (15,000 acres) Western Himalayan broadleaf forests and subalpine conifer forests temperate broadleaf mixed forests and montane forests biome Indonesia Leuser Ecosystem Sumatran montane rain forests Sumatran lowland rain forests tropical rainforest tropical montane forest Indonesia Lorentz National Park New Guinea mangrovesSouthern New Guinea lowland forestsNew Guinea montane forests Indonesia Mamberamo Foja Wildlife Reserve Northern New Guinea lowland rain and freshwater swamp forests Northern New Guinea montane rain forests Iran Coast along the Caspian Sea and the northern slopes of the Alborz mountains Caspian Hyrcanian mixed forest[2] temperate broadleaf and mixed forests biome Japan Shiretoko National Park Hokkaido deciduous forests, Hokkaido montane conifer forests[citation needed] temperate and subalpine mixed forest Japan Yakushima Wilderness Area Nansei Islands subtropical evergreen forests, Taiheiyo evergreen forests subtropical and temperate rainforest Japan Kasugayama Primeval Forest Taiheiyo evergreen forests Malaysia Belum-Temengor[3] Peninsular Malaysian rain forests Malaysia Danum Valley Borneo lowland rain forests Malaysia Taman Negara Peninsular Malaysian rain forests Malaysia Ulu Muda Forest Peninsular Malaysian rain forests Russia Central Sikhote-Alin Ussuri broadleaf and mixed forests Russia Virgin Komi Forests Urals montane tundra and taiga Coniferous Russia Western Caucasus Caucasus mixed forests Taiwan Yushan National Park Taiwan subtropical evergreen forests Taiwania Australia[edit] See also: Regional Reserve (Australia) and Category:State forests in Australia This section needs expansion. You can help by adding to it. (June 2008) Eucalyptus forest in the Cradle Mountain-Lake St Clair National Park Walpole Wilderness Area In Australia, the 1992 National Forest Policy Statement (NFPS) made specific provision for the protection of old growth forests. The NFPS initiated a process for undertaking assessments of forests for conservation values, including old growth values. A working group of state and Australian Government agencies took the NFPS definition into consideration in developing a definition that was accepted by all governments (JANIS 1997).[4] Old growth forest is ecologically mature forest where the effects of disturbances are now negligible. JANIS 1997 In 2008, only a relatively small area (15) of Australias forests (mostly tall, wet forests) had been assessed for old-growth values.[5] Of the 23 million hectares (57 million acres) of forest in Australia assessed for their old-growth status, 5 million hectares (12 million acres) (22) is classified as old-growth.[6] Almost half of Australias identified old-growth forest is in NSW, mostly on public land.[5] More than 73 of Austral..."},{"id":"node_22","title":"Winning the Game You Didn’t Even Want to Play: On Sally Rooney and the Literature of the Pose","url":"https://lithub.com/winning-the-game-you-didnt-even-want-to-play-on-sally-rooney-and-the-literature-of-the-pose/","cluster":2,"position":{"x":9.381629943847656,"y":4.234498977661133},"keywords":["Craft and Criticism Literary Criticism Craft","the Novel Poem News","The Critic and Her Publics Windham-Campbell Prizes Podcast Memoir Nation","Poetry Short Story","the Literature"],"content_preview":"Literary Hub Craft and Criticism Literary Criticism Craft and Advice In Conversation On Translation Fiction and Poetry Short Story From the Novel Poem News and Culture History Science Politics Biograp...","content":"Literary Hub Craft and Criticism Literary Criticism Craft and Advice In Conversation On Translation Fiction and Poetry Short Story From the Novel Poem News and Culture History Science Politics Biography Memoir Food Technology Bookstores and Libraries Film and TV Travel Music Art and Photography The Hub Style Design Sports Lit Hub Radio The Lit Hub Podcast Awakeners FictionNonFiction The Critic and Her Publics Windham-Campbell Prizes Podcast Memoir Nation Beyond the Page First Draft: A Dialogue on Writing Thresholds The Cosmic Library Culture Schlock Reading Lists The Best of the Decade Book Marks Best Reviewed Books CrimeReads True Crime The Daily Thrill Log In Craft and Criticism Literary Criticism Craft and Advice In Conversation On Translation Fiction and Poetry Short Story From the Novel Poem News and Culture History Science Politics Biography Memoir Food Technology Bookstores and Libraries Film and TV Travel Music Art and Photography The Hub Style Design Sports Lit Hub Radio The Lit Hub Podcast Awakeners FictionNonFiction The Critic and Her Publics Windham-Campbell Prizes Podcast Memoir Nation Beyond the Page First Draft: A Dialogue on Writing Thresholds The Cosmic Library Culture Schlock Reading Lists The Best of the Decade Book Marks Best Reviewed Books CrimeReads True Crime The Daily Thrill Log In Winning the Game You Didnt Even Want to Play: On Sally Rooney and the Literature of the Pose Stephen Marche Considers Contemporary Fictions Slow Abandonment of Literary Voice Stephen Marche September 15, 2021 Sally Rooney is unhappy. Sally Rooney has everything and Sally Rooney is unhappy. Sally Rooney is unhappy because Sally Rooney has everything.Article continues after advertisement If literary careers are like games, and they are, then Sally Rooney has won: the massive bestselling debut, the even more massive, even more bestselling follow-up, the successful television adaptation, the profiles, the prizes. I write to you from Paris, having just arrived here from London, where I had to go and pick up an award. They never tired of giving me awards, do they? Its a shame Ive tired so quickly of receiving them, she writes in her new book Beautiful World, Where Are You (no question mark). Her own celebrity, for Sally Rooney, is evidence of insanity, both in the people who envy it and in the society that values it. Okay, its been a small experience in its own way, and it will all blow over in a few months or years and no one will even remember me, thank God, she writes. And then thats it, Im finished, and the next flashy twenty-five year old with an impending psychological collapse comes along. Her new novel is, in a sense, the collapse that has been impending. Sally Rooney has jumped through the worlds hoops, and found, at the end, the emptiness of all hoops. But Beautiful World, Where Are You is more than a young, healthy, successful, rich, famous woman in love complaining about youth, health, success, wealth, fame and love. It arrives at a particular moment in literary history, a point of transition, or properly speaking two simultaneous transitions. The literature of the voice is dying. The literature of the pose has arrived. The basis of literary style has shifted. When I was in university, and friends with mainly fellow literature obsessives, orlets be honestgeeks, we would play a game where someone would read the first sentence on page 149 of any given book and the rest of us would have to guess who wrote it. Examples:Article continues after advertisement The nephew came back from peeing inside the house, and after touching his lips for silence, pointed his thumb to say that what they were looking for was round back. And Godlook out!the Portobello Road, the whole trench scuffed and frayed, falling apart, and full of rats. He was a young man and he refused and having recognized the harnessmaker for a white man spoke to him in a way that made the harnessmaker ashamed so that he invited the young man to come to his dwelling a few miles distant on the road. The idea at the timethis was the 1990swas that any well read person should be able to figure out who was writing from any given sentence they wrote. (In this case, Toni Morrisons Beloved, Martin Amiss London Fields, and Cormac McCarthys Blood Meridian.) Some writers, like Thomas Pynchon, nobody would ever pick. Too easy. It is next to impossible to play the page 149 game with the 21st-century novel. But lets try anyway.Article continues after advertisement Four hours later his alarm clock woke him. The show was a brutal success, one critic called it. But Im okay actually, I just need to get cleaned up. There is not a word out of place. Each sentence passes quality assurance: The above sentences are certified, not wrong. The writing of the pose is, first and foremost, about being correct, both in terms of style and content. Its foremost goal is not to make any mistakes. Its foremost gesture is erasure and its foremost subject is social anxiety and self-pr..."},{"id":"node_23","title":"A KVCache-centric Disaggregated Architecture for LLM Serving","url":"https://github.com/kvcache-ai/Mooncake","cluster":4,"position":{"x":8.383377075195312,"y":1.5200583934783936},"keywords":["kvcache-ai.github.ioMooncake License Apache-2.0","Mooncake Public Notifications","Fork 420 Star 4.2k Mooncake","github.github FAST25-releaseFAST25-release benchmarksxypd_benchmarksbenchmarksxypd_benchmarks docdoc docsdocs externextern imageimage mooncake-commonmooncake-common mooncake-epmooncake-ep mooncake-integrationmooncake-integration mooncake-p2p-storemooncake-p2p-store mooncake-rlexamplesmooncake-rlexamples mooncake-storemooncake-store mooncake-transfer-enginemooncake-transfer-engine mooncake-wheelmooncake-wheel scriptsscripts","kvcache"],"content_preview":"kvcache-ai  Mooncake Public Notifications You must be signed in to change notification settings Fork 420 Star 4.2k Mooncake is the serving platform for Kimi, a leading LLM service provided by Moonshot...","content":"kvcache-ai  Mooncake Public Notifications You must be signed in to change notification settings Fork 420 Star 4.2k Mooncake is the serving platform for Kimi, a leading LLM service provided by Moonshot AI. kvcache-ai.github.ioMooncake License Apache-2.0 license 4.2k stars 420 forks Branches Tags Activity Star Notifications You must be signed in to change notification settings kvcache-aiMooncake mainBranchesTagsGo to fileCodeOpen more actions menuFolders and filesNameNameLast commit messageLast commit dateLatest commit History611 Commits.ci.ci .devcontainer.devcontainer .github.github FAST25-releaseFAST25-release benchmarksxypd_benchmarksbenchmarksxypd_benchmarks docdoc docsdocs externextern imageimage mooncake-commonmooncake-common mooncake-epmooncake-ep mooncake-integrationmooncake-integration mooncake-p2p-storemooncake-p2p-store mooncake-rlexamplesmooncake-rlexamples mooncake-storemooncake-store mooncake-transfer-enginemooncake-transfer-engine mooncake-wheelmooncake-wheel scriptsscripts .clang-format.clang-format .gitignore.gitignore .gitmodules.gitmodules .typos.toml.typos.toml CMakeLists.txtCMakeLists.txt CONTRIBUTING.mdCONTRIBUTING.md DockerfileDockerfile LICENSE-APACHELICENSE-APACHE README.mdREADME.md dependencies.shdependencies.sh requirements_docs.txtrequirements_docs.txt View all filesRepository files navigation A KVCache-centric Disaggregated Architecture for LLM Serving Paper  Slides  Traces  Technical Report  Blog  Slack Mooncake is the serving platform for Kimi, a leading LLM service provided by Moonshot AI. Now both the Transfer Engine and Mooncake Store are open-sourced! This repository also hosts its technical report and the open sourced traces.  Updates Sept 10, 2025: SGLang officially supports Mooncake Store as a hierarchical KV caching storage backend. The integration extends RadixAttention with multi-tier KV cache storage across device, host, and remote storage layers. Sept 10, 2025: The official  high-performance version of Mooncake P2P Store is open-sourced as checkpoint-engine. It has been successfully applied in K1.5 and K2 production training, updating Kimi-K2 model (1T parameters) across thousands of GPUs in 20s. Aug 23, 2025: xLLM high-performance inference engine builds hybrid KV cache management based on Mooncake, supporting global KV cache management with intelligent offloading and prefetching. Aug 18, 2025: vLLM-Ascend integrates Mooncake Transfer Engine for KV cache register and disaggregate prefill, enabling efficient distributed inference on Ascend NPUs. Jul 20, 2025: Mooncake powers the deployment of Kimi K2 on 128 H200 GPUs with PD disaggregation and large-scale expert parallelism, achieving 224k tokenssec prefill throughput and 288k tokenssec decode throughput. Jun 20, 2025: Mooncake becomes a PD disaggregation backend for LMDeploy. May 9, 2025: NIXL officially supports Mooncake Transfer Engine as a backend plugin. May 8, 2025: Mooncake x LMCache unite to pioneer KVCache-centric LLM serving system. May 5, 2025: Supported by Mooncake Team, SGLang release guidance to deploy DeepSeek with PD Disaggregation on 96 H100 GPUs. Apr 22, 2025: LMCache officially supports Mooncake Store as a remote connector. Apr 10, 2025: SGLang officially supports Mooncake Transfer Engine for disaggregated prefilling and KV cache transfer. Mar 7, 2025: We open sourced the Mooncake Store, a distributed KVCache based on Transfer Engine. vLLMs xPyD disaggregated prefilling  decoding based on Mooncake Store will be released soon. Feb 25, 2025: Mooncake receives the Best Paper Award at FAST 2025! Feb 21, 2025: The updated traces used in our FAST25 paper have been released. Dec 16, 2024: vLLM officially supports Mooncake Transfer Engine for disaggregated prefilling and KV cache transfer. Nov 28, 2024: We open sourced the Transfer Engine, the central component of Mooncake. We also provide two demonstrations of Transfer Engine: a P2P Store and vLLM integration. July 9, 2024: We open sourced the trace as a jsonl file. June 27, 2024: We present a series of Chinese blogs with more discussions on zhihu 1, 2, 3, 4, 5, 6, 7. June 26, 2024: Initial technical report release.  Overview Mooncake features a KVCache-centric disaggregated architecture that separates the prefill and decoding clusters. It also leverages the underutilized CPU, DRAM, and SSD resources of the GPU cluster to implement a disaggregated cache of KVCache. The core of Mooncake is its KVCache-centric scheduler, which balances maximizing overall effective throughput while meeting latency-related Service Level Objectives (SLOs) requirements. Unlike traditional studies that assume all requests will be processed, Mooncake faces challenges due to highly overloaded scenarios. To mitigate these, we developed a prediction-based early rejection policy. Experiments show that Mooncake excels in long-context scenarios. Compared to the baseline method, Mooncake can achieve up to a 525 increase in throughput in certain simulated scenarios while adhering to SLO..."},{"id":"node_24","title":"CCQ: Convolutional Code for Extreme Low-bit Quantization in LLMs","url":"https://arxiv.org/abs/2507.07145","cluster":4,"position":{"x":6.784559726715088,"y":2.9368720054626465},"keywords":["Convolutional Code Quantization","Extreme Low-bit Quantization","an inference-optimized quantization approach","slow vector quantization","error-prone scalar quantization"],"content_preview":"Computer Science  Machine Learning arXiv:2507.07145 (cs) [Submitted on 9 Jul 2025] Title:CCQ: Convolutional Code for Extreme Low-bit Quantization in LLMs Authors:Zhaojing Zhou, Xunchao Li, Minghao Li,...","content":"Computer Science  Machine Learning arXiv:2507.07145 (cs) [Submitted on 9 Jul 2025] Title:CCQ: Convolutional Code for Extreme Low-bit Quantization in LLMs Authors:Zhaojing Zhou, Xunchao Li, Minghao Li, Handi Zhang, Haoshuang Wang, Wenbin Chang, Yiqun Liu, Qingqing Dang, Dianhai Yu, Yanjun Ma, Haifeng Wang View a PDF of the paper titled CCQ: Convolutional Code for Extreme Low-bit Quantization in LLMs, by Zhaojing Zhou and 10 other authors View PDF HTML (experimental) Abstract:The rapid scaling of Large Language Models (LLMs) elevates inference costs and compounds substantial deployment barriers. While quantization to 8 or 4 bits mitigates this, sub-3-bit methods face severe accuracy, scalability, and efficiency degradation. We propose Convolutional Code Quantization (CCQ), an inference-optimized quantization approach compressing LLMs to 2.0-2.75 bits with minimal accuracy loss. Departing from error-prone scalar quantization or slow vector quantization, CCQ integrates a hardware-aware bit-shift encoding and decoding solution with Convolutional Code, Hybrid Encoding, and Code Cluster, jointly overcoming accuracy-speed bottlenecks. We construct a lookup-free encoding space, enabling a linear mapping between the codebook and weight vectors, thereby optimizing inference performance. Meanwhile, by drawing on the concept of data mapping from vector quantization, we minimize the performance degradation of the model under extremely low-bit conditions. Experiments demonstrate that CCQ achieves outstanding performance on LLMs across various benchmarks. We compress DeepSeek-V3 (671B total parameters) to 184GB and ERNIE-4.5-300B-A47B to 89GB, enabling single-GPU deployment of ERNIE 4.5 and eliminating inter-card communication. The 2-bit ERNIE-4.5-300B-A47B model and inference engine have been open-sourced. Comments: 11 pages, 3 figures Subjects: Machine Learning (cs.LG) Cite as: arXiv:2507.07145 [cs.LG] (or arXiv:2507.07145v1 [cs.LG] for this version) https:doi.org10.48550arXiv.2507.07145 Focus to learn more arXiv-issued DOI via DataCite Submission history From: Minghao Li [view email] [v1] Wed, 9 Jul 2025 06:04:14 UTC (369 KB) Full-text links: Access Paper: View a PDF of the paper titled CCQ: Convolutional Code for Extreme Low-bit Quantization in LLMs, by Zhaojing Zhou and 10 other authorsView PDFHTML (experimental)TeX Source view license Current browse context: cs.LG  prev  next  new  recent  2025-07 Change to browse by: cs References  Citations NASA ADSGoogle Scholar Semantic Scholar export BibTeX citation Loading... BibTeX formatted citation  loading... Data provided by: Bookmark Bibliographic Tools Bibliographic and Citation Tools Bibliographic Explorer Toggle Bibliographic Explorer (What is the Explorer?) Connected Papers Toggle Connected Papers (What is Connected Papers?) Litmaps Toggle Litmaps (What is Litmaps?) scite.ai Toggle scite Smart Citations (What are Smart Citations?) Code, Data, Media Code, Data and Media Associated with this Article alphaXiv Toggle alphaXiv (What is alphaXiv?) Links to Code Toggle CatalyzeX Code Finder for Papers (What is CatalyzeX?) DagsHub Toggle DagsHub (What is DagsHub?) GotitPub Toggle Gotit.pub (What is GotitPub?) Huggingface Toggle Hugging Face (What is Huggingface?) Links to Code Toggle Papers with Code (What is Papers with Code?) ScienceCast Toggle ScienceCast (What is ScienceCast?) Demos Demos Replicate Toggle Replicate (What is Replicate?) Spaces Toggle Hugging Face Spaces (What is Spaces?) Spaces Toggle TXYZ.AI (What is TXYZ.AI?) Related Papers Recommenders and Search Tools Link to Influence Flower Influence Flower (What are Influence Flowers?) Core recommender toggle CORE Recommender (What is CORE?) IArxiv recommender toggle IArxiv Recommender (What is IArxiv?) Author Venue Institution Topic About arXivLabs arXivLabs: experimental projects with community collaborators arXivLabs is a framework that allows collaborators to develop and share new arXiv features directly on our website. Both individuals and organizations that work with arXivLabs have embraced and accepted our values of openness, community, excellence, and user data privacy. arXiv is committed to these values and only works with partners that adhere to them. Have an idea for a project that will add value for arXivs community? Learn more about arXivLabs. Which authors of this paper are endorsers?  Disable MathJax (What is MathJax?)"},{"id":"node_25","title":"Eat Poop You Cat | Issue 48 | n+1 | Rachel Ossip","url":"https://www.nplusonemag.com/issue-48/essays/eat-poop-you-cat/?highlight=artificial%20intelligence","cluster":2,"position":{"x":8.89708137512207,"y":1.9953467845916748},"keywords":["Hollow ManThe Editors"],"content_preview":"Hollow ManThe Editors...","content":"Hollow ManThe Editors"},{"id":"node_26","title":"‘My sadness is not a burden’: author Yiyun Li on the suicide of both her sons | Fiction | The Guardian","url":"https://www.theguardian.com/books/2025/may/17/author-yiyun-li-on-the-suicide-of-both-her-sons","cluster":3,"position":{"x":9.209616661071777,"y":3.557631015777588},"keywords":["Poor woman Yiyun Li","author Yiyun Li","her dead son","both her sonsThis article","her elder son"],"content_preview":"Going out, people will always look at me and say, Poor woman  Yiyun Li. Photograph: Maria SpannView image in fullscreenGoing out, people will always look at me and say, Poor woman  Yiyun Li. Photograp...","content":"Going out, people will always look at me and say, Poor woman  Yiyun Li. Photograph: Maria SpannView image in fullscreenGoing out, people will always look at me and say, Poor woman  Yiyun Li. Photograph: Maria Spann This article is more than 5 months oldInterviewMy sadness is not a burden: author Yiyun Li on the suicide of both her sonsThis article is more than 5 months oldSophie McBainAs her memoir of losing her sons is published, the author talks about radical acceptance and how writing fiction helped her to prepare for tragedyAs the novelist Yiyun Li often observes, there is no good way to state the facts of her life and yet they are inescapable: she had two sons, and both died by suicide. After her elder son Vincent died in 2017, at the age of 16, Li wrote a novel for him. Where Reasons End is a conversation, sometimes an argument, between a mother and her dead son, and it is a work of fiction that doesnt feel fictional at all, because its also an encounter between a writer in mourning and the son she can still conjure up on the page. With Vincents book there was that joy of meeting him again in the book, hearing him, seeing him, it was like he was alive, she says. The book had 16 chapters, one for each year of his life, and Li felt she could have spent the rest of her life writing it, and also that she could not linger.When her younger son James died in 2024, aged 19, Li wanted to write a book for him, too. James was harder to write for. Her sons were best friends but such different boys, she says. She and James did not argue in the same way as she did with Vincent, and he would hate to be thrust into the spotlight, or for her to write a sentimental book. James had a mind so brilliant that his inner workings were often unreachable  by seven or eight hed open meal-time conversations with apparently the Higgs boson  or apparently the predatory tunicates . He did not speak often, but could converse in eight languages and his phone was set to Lithuanian, a ninth. He once described Daniel Tammets Born on a Blue Day: Inside the Extraordinary Mind of an Autistic Savant as the only book that captured how he felt about the world. If Vincent lived feelingly, James lived thinkingly, Li says, and she wanted her book for him to be as clear as James, as logical and rational.View image in fullscreenFor months after his death, Li worried that she lacked the vocabulary to write about James, but then she began writing and realised of course I could do this, this is what I do. Things in Nature Merely Grow, her memoir of losing her sons, is resolutely unsentimental, and yet it might wind you with its emotional force. She wrote it in less than two months. Often people ask her if writing the book was cathartic. No, never! she replies. If it offered solace, it was the solace of thinking. When I was writing the book it felt like I was at the centre of a hurricane. The eye of the hurricane is the stillest place. Its very quiet and clear, she says. And then she finished writing, and she stepped back into the hurricane. My life goes on as a very strange woman, she tells me, strange because her losses are so extreme: Going out, people will always look at me and say, Poor woman.We meet at her home in Princeton, where photographs of her sons and paintings by Vincent decorate the walls, and every bookshelf is stacked two-deep. It is early spring, still cold, and the trees remain bare, but Li planted 1,600 bulbs in autumn and in the garden are bright clusters of daffodils, hyacinths and tulips. Gardening, which requires a constant revision of ambitions, is good practice for novel-writing and for life, Li observes, but these flowers are not a metaphor. She rejects the idea that grief is a process, that theres light at the end of the tunnel. Even if she could turn the page, as the Chinese phrase goes, she would not want to. Li often looks up the etymology of words and notes that grief derives from burden. My children were not my burden. My sadness is not my burden, she says.View image in fullscreenYiyun Lis husband, Dapeng, with sons Vincent, left, and James. Photograph: Yiyun LiLi is the author of 12 books  among them novels, short-story collections, memoirs and literary criticism  and in 2010 she won a MacArthur genius grant. She is 52, slight, with cropped hair and a gentle manner. Soon after I arrive, she asks if I have children, which I do, and she says she realises this interview must be hard for me, too. She makes tea and puts out a plate of biscuits and checks several times that I am not cold or hungry. Later, she cooks lunch. At Princeton University, where she is a professor of creative writing, she says she tries to cultivate the right distance with her students, neither aloof nor maternal  and then sometimes she finds herself asking whether theyve drunk enough water that day.In her fiction classes, Li bans her students from writing about car crashes. In high emergencies peoples feelings are always the same, she tells them, an..."},{"id":"node_27","title":"An 'Anti-Woke' Literary Scene Growing in L.A.","url":"https://www.rollingstone.com/culture/culture-features/anti-woke-literary-scene-la-1235376357/","cluster":0,"position":{"x":10.036612510681152,"y":3.018467903137207},"keywords":["the anti-woke arts scene","hibernation","the pagan decor","the spring equinox","a rebirth"],"content_preview":"By John McDermott John McDermott July 6, 2025 John McDermott Matt Pegas neatly arranges stacks of books atop the red tablecloth at the reception table in the front yard of the house party. Surrounding...","content":"By John McDermott John McDermott July 6, 2025 John McDermott Matt Pegas neatly arranges stacks of books atop the red tablecloth at the reception table in the front yard of the house party. Surrounding the books is a tableau of candles, rose petals, a tarot deck, and packets of wildflower seeds, which guests are encouraged to take home and plant. Midnight will mark the spring equinox, and the pagan decor is meant to celebrate a rebirth, because, they say, after years of being tacitly driven underground, the anti-woke arts scene in Los Angeles is ready to blossom in full view. We have been in hibernation. We have been in the cold. Weve been hiding. Now were out in the open, says party organizer and emcee Adem Luz Rienspects, clad in a white linen shirt and pants. The function, held in a single-family home in L.A.s Lincoln Heights, is, at a glance, your standard collection of Eastside scenesters  nebbish guys in glasses; handsome bros in black leather jackets; guys with long Seventies rocker hair; doughy, bearded guys in ball caps, accompanied by women several magnitudes hotter than them; a man in a tweedy three-piece suit; a woman whos a dead ringer for Naomi Watts. Several women wear lacy white dresses and flower crowns, in accordance with the theme. The requisite amounts of woo woo and pretension. Nearly everyone is white. Tonight is no mere house party, though  its a literary salon hosted by New Ritual Press, an independent publishing label founded by Pegas and fellow indie author Dan Baltic. New Ritual Press just released its first book, the short story collection An Odyssey of Dingbats by Omar King, one of several pieces featured in tonights readings. More generally, the event is an act of defiance against wokeness, which, these critics say, has for too long stifled free expression, at the expense of creating quality art. One of the primary reasons why Kamala Harris got thumped in the election is that a number of the Democratic Partys core constituencies have grown disillusioned with the party and drifted rightward over the past several years. Black, Native American, Hispanic and, young voters all voted Republican in greater numbers in the 2024 election compared to 2020. Culturally, too, there has been a shocking shift to the right among traditionally leftist groups, such as crunchy, health-conscious women, who are enamored of Robert F. Kennedy, Jr., his vaccine skepticism and promotion of alternate wellness theories; young people converting to Catholicism in droves; and, apparently, a bunch of young creative types in a large, deep-blue coastal city. Editors picks The 250 Greatest Albums of the 21st Century So Far The 100 Best TV Episodes of All Time The 500 Greatest Albums of All Time 100 Best Movies of the 21st Century Theres a massive cultural pushback against millennial moral censorship, Chris Zeisscheig, a former porn performer turned indie novelist, tells me while watching the party crowd with removed awe. Matt Pegas Chris Zeischegg Dan Baltic, a co-founder in New Ritual Press and one of tonights readers, remembers being reprimanded in 2019 in a writing workshop by a woman who was appalled by the alt-right protagonist of his debut novel, Nutcrankr. The class liked it, and one woman said, Its obvious youre a very good writer. Why would you choose to write this? That comment really took me aback. The answer obviously is because I wanted to write about it. Seemingly, she appreciated it aesthetically. In my sense, the story did its job. The better question to ask is, Why would you ask that question? The answer to that question being that all art should adhere to certain liberal principles and never dare offend them. The backlash in historically liberal cultural circles has been deemed the Vibe Shift, a term coined by Substack writer Sean Monahan in 2021, and later adopted by the mainstream press, to describe the growing number of young people rejecting the woke identity-based politics largely embraced by the contemporary Left. Wokeness first rose to prominence during the Obama years and went mainstream after the gender reckoning of MeToo, the racial awakening of Black Lives Matter, and the anti-Trump Resistance of his first term. Related Content This Childrens Book Celebrates Zohran Mamdanis Historic New York City Mayoral Race Everythings Coming Up L.A. Melissa Auf der Maur Will Reveal All in 90s Rock Memoir Cameron Crowes First Memoir Is Here: Buy Online For a while, woke had a positive connotation  co-opted from Black communities, it had come to mean being awoken to the historical wrongs perpetrated against women and people of color. At first, this was a welcome development, a long overdue correction to the racial and gender inequities in artistic endeavors. But after a while, a backlash started brewing, one that felt wokeness was overly censorious and punitive of anyone who dared challenge identitarian political ideals. To them, woke became synonymous with Cancel Culture, people being publicly shunn..."},{"id":"node_28","title":"Seven Types of Ambiguity - Wikipedia","url":"https://en.wikipedia.org/wiki/Seven_Types_of_Ambiguity","cluster":2,"position":{"x":8.79024887084961,"y":4.541905879974365},"keywords":["1947)AuthorWilliam EmpsonGenreLiterary criticismPublication date1930 Seven Types","Ambiguity","literary criticism","the New Criticism","the Elliot Perlman novel"],"content_preview":"From Wikipedia, the free encyclopedia Book by William Empson This article is about the book by William Empson. For the Elliot Perlman novel, see Seven Types of Ambiguity (novel). For the television se...","content":"From Wikipedia, the free encyclopedia Book by William Empson This article is about the book by William Empson. For the Elliot Perlman novel, see Seven Types of Ambiguity (novel). For the television series, see Seven Types of Ambiguity (TV series).Seven Types of Ambiguity Title page for Seven Types of Ambiguity (1947)AuthorWilliam EmpsonGenreLiterary criticismPublication date1930 Seven Types of Ambiguity is a work of literary criticism by William Empson which was first published in 1930. It was one of the most influential critical works of the 20th century[citation needed] and was a key foundation work in the formation of the New Criticism school.[1] The book is organized around seven types of ambiguity that Empson finds in the poetry he discusses. The second edition (revised) was published by Chatto  Windus, London, 1947, and there was another revised edition in 1953. The first printing in America was by New Directions in 1947. Seven Types of Ambiguity ushered in New Criticism in the United States. The book is a guide to a style of literary criticism practiced by Empson. An ambiguity is represented as a puzzle to Empson. We have ambiguity when alternative views might be taken without sheer misreading. Empson reads poetry as an exploration of conflicts within the author. Seven types[edit] The first type of ambiguity is the metaphor, that is, when two things are said to be alike which have different properties. This concept is similar to that of metaphysical conceit. Two or more meanings are resolved into one. Empson characterizes this as using two different metaphors at once. Two ideas that are connected through context can be given in one word simultaneously. Two or more meanings that do not agree but combine to make clear a complicated state of mind in the author. When the author is discovering his idea in the act of writing... Empson describes a simile that lies halfway between two statements made by the author. When a statement says nothing and the readers are forced to invent a statement of their own, most likely in conflict with that of the author. Two words that within context are opposites that expose a fundamental division in the authors mind.[2] References[edit]  Sir William Empson, Encyclopædia Britannica 2003 DVD Edition.  The Sacrifice, Chapter VII from Seven Types of Ambiguity, William Empson.Type_Document_Title_here. Archived from the original on October 27, 2009. Retrieved 2007-04-11.cite web: CS1 maint: bot: original URL status unknown (link) Retrieved from https:en.wikipedia.orgwindex.php?titleSeven_Types_of_Ambiguityoldid1310158288 Categories: AmbiguityBooks of literary criticism1930 non-fiction booksSemanticsChatto  Windus booksHidden categories: CS1 maint: bot: original URL status unknownArticles with short descriptionShort description matches WikidataAll articles with unsourced statementsArticles with unsourced statements from January 2025"},{"id":"node_29","title":"Emergency by Denis Johnson","url":"https://www.narrativemagazine.com/issues/stories-week-2014-2015/story-week/emergency-denis-johnson","cluster":1,"position":{"x":9.673798561096191,"y":2.512639045715332},"keywords":["the emergency room","his mop","the mop","the operating room","a mop"],"content_preview":"A Storyby Denis Johnson Share Facebook Threads Reddit Forward Print Copy link Id been working in the emergency room for about three weeks, I guess. This was in 1973, before the summer ended. With noth...","content":"A Storyby Denis Johnson Share Facebook Threads Reddit Forward Print Copy link Id been working in the emergency room for about three weeks, I guess. This was in 1973, before the summer ended. With nothing to do on the overnight shift but batch the insurance reports from the daytime shifts, I just started wandering around, over to the coronary-care unit, down to the cafeteria, et cetera, looking for Georgie, the orderly, a pretty good friend of mine. He often stole pills from the cabinets. He was running over the tiled floor of the operating room with a mop. Are you still doing that? I said. Jesus, theres a lot of blood here, he complained. Where? The floor looked clean enough to me. What the hell were they doing in here? he asked me. They were performing surgery, Georgie, I told him. Theres so much goop inside of us, man, he said, and it all wants to get out. He leaned his mop against a cabinet. What are you crying for? I didnt understand. He stood still, raised both arms slowly behind his head, and tightened his ponytail. Then he grabbed the mop and started making broad random arcs with it, trembling and weeping and moving all around the place really fast. What am I crying for? he said. Jesus. Wow, oh boy, perfect. I was hanging out in the E.R. with fat, quivering Nurse. One of the Family Service doctors that nobody liked came in looking for Georgie to wipe up after him. Wheres Georgie? this guy asked. Georgies in O.R., Nurse said. Again? No, Nurse said. Still. Still? Doing what? Cleaning the floor. Again? No, Nurse said again. Still. Back in O.R., Georgie dropped his mop and bent over in the posture of a child soiling its diapers. He stared down with his mouth open in terror. He said, What am I going to do about these fucking shoes, man? Whatever you stole, I said, I guess you already ate it all, right? Listen to how they squish, he said, walking around carefully on his heels. Let me check your pockets, man. He stood still a minute, and I found his stash. I left him two of each, whatever they were. Shift is about half over, I told him. Good. Because I really, really, really need a drink, he said. Will you please help me get this blood mopped up? Around 3:30 a.m. a guy with a knife in his eye came in, led by Georgie. I hope you didnt do that to him, Nurse said. Me? Georgie said. No. He was like this. My wife did it, the man said. The blade was buried to the hilt in the outside corner of his left eye. It was a hunting knife kind of thing. Who brought you in? Nurse said. Nobody. I just walked down. Its only three blocks, the man said. Nurse peered at him. Wed better get you lying down. Okay, Im certainly ready for something like that, the man said. She peered a bit longer into his face. Is your other eye, she said, a glass eye? Its plastic, or something artificial like that, he said. And you can see out of this eye? she asked, meaning the wounded one. I can see. But I cant make a fist out of my left hand because this knife is doing something to my brain. My God, Nurse said. I guess Id better get the doctor, I said. There you go, Nurse agreed. They got him lying down, and Georgie says to the patient, Name? Terrence Weber. Your face is dark. I cant see what youre saying. Georgie, I said. What are you saying, man? I cant see. Nurse came over, and Georgie said to her, His face is dark. She leaned over the patient. How long ago did this happen, Terry? she shouted down into his face. Just a while ago. My wife did it. I was asleep, the patient said. Do you want the police? He thought about it and finally said, Not unless I die. Nurse went to the wall intercom and buzzed the doctor on duty, the Family Service person. Got a surprise for you, she said over the intercom. He took his time getting down the hall to her, because he knew she hated Family Service and her happy tone of voice could only mean something beyond his competence and potentially humiliating. He peeked into the trauma room and saw the situation: the clerkthat is, mestanding next to the orderly, Georgie, both of us on drugs, looking down at a patient with a knife sticking up out of his face. What seems to be the trouble? he said. To continue reading please sign in. Join for free Already a reader? Sign In"},{"id":"node_30","title":"What Happens After A.I. Destroys College Writing? | The New Yorker","url":"https://www.newyorker.com/magazine/2025/07/07/the-end-of-the-english-paper","cluster":1,"position":{"x":9.430195808410645,"y":2.521442413330078},"keywords":["Alex","ChatGPT","clear broth","his bag","his notes"],"content_preview":"Save this storySave this storySave this storySave this storyOn a blustery spring Thursday, just after midterms, I went out for noodles with Alex and Eugene, two undergraduates at New York University, ...","content":"Save this storySave this storySave this storySave this storyOn a blustery spring Thursday, just after midterms, I went out for noodles with Alex and Eugene, two undergraduates at New York University, to talk about how they use artificial intelligence in their schoolwork. When I first met Alex, last year, he was interested in a career in the arts, and he devoted a lot of his free time to photo shoots with his friends. But he had recently decided on a more practical path: he wanted to become a C.P.A. His Thursdays were busy, and he had forty-five minutes until a study session for an accounting class. He stowed his skateboard under a bench in the restaurant and shook his laptop out of his bag, connecting to the internet before we sat down.Alex has wavy hair and speaks with the chill, singsong cadence of someone who has spent a lot of time in the Bay Area. He and Eugene scanned the menu, and Alex said that they should get clear broth, rather than spicy, so we can both lock in our skin care. Weeks earlier, when Id messaged Alex, he had said that everyone he knew used ChatGPT in some fashion, but that he used it only for organizing his notes. In person, he admitted that this wasnt remotely accurate. Any type of writing in life, I use A.I., he said. He relied on Claude for research, DeepSeek for reasoning and explanation, and Gemini for image generation. ChatGPT served more general needs. I need A.I. to text girls, he joked, imagining an A.I.-enhanced version of Hinge. I asked if he had used A.I. when setting up our meeting. He laughed, and then replied, Honestly, yeah. Im not tryin to type all that. Could you tell?OpenAI released ChatGPT on November 30, 2022. Six days later, Sam Altman, the C.E.O., announced that it had reached a million users. Large language models like ChatGPT dont think in the human sensewhen you ask ChatGPT a question, it draws from the data sets it has been trained on and builds an answer based on predictable word patterns. Companies had experimented with A.I.-driven chatbots for years, but most sputtered upon release; Microsofts 2016 experiment with a bot named Tay was shut down after sixteen hours because it began spouting racist rhetoric and denying the Holocaust. But ChatGPT seemed different. It could hold a conversation and break complex ideas down into easy-to-follow steps. Within a month, Googles management, fearful that A.I. would have an impact on its search-engine business, declared a code red.Among educators, an even greater panic arose. It was too deep into the school term to implement a coherent policy for what seemed like a homework killer: in seconds, ChatGPT could collect and summarize research and draft a full essay. Many large campuses tried to regulate ChatGPT and its eventual competitors, mostly in vain. I asked Alex to show me an example of an A.I.-produced paper. Eugene wanted to see it, too. He used a different A.I. app to help with computations for his business classes, but he had never gotten the hang of using it for writing. I got you, Alex told him. (All the students I spoke with are identified by pseudonyms.)He opened Claude on his laptop. I noticed a chat that mentioned abolition. We had to read Robert Wedderburn for a class, he explained, referring to the nineteenth-century Jamaican abolitionist. But, obviously, I wasnt tryin to read that. He had prompted Claude for a summary, but it was too long for him to read in the ten minutes he had before class started. He told me, I said, Turn it into concise bullet points.  He then transcribed Claudes points in his notebook, since his professor ran a screen-free classroom.Alex searched until he found a paper for an art-history class, about a museum exhibition. He had gone to the show, taken photographs of the images and the accompanying wall text, and then uploaded them to Claude, asking it to generate a paper according to the professors instructions. Im trying to do the least work possible, because this is a class Im not hella fucking with, he said. After skimming the essay, he felt that the A.I. hadnt sufficiently addressed the professors questions, so he refined the prompt and told it to try again. In the end, Alexs submission received the equivalent of an A-minus. He said that he had a basic grasp of the papers argument, but that if the professor had asked him for specifics hed have been so fucked. I read the paper over Alexs shoulder; it was a solid imitation of how an undergraduate might describe a set of images. If this had been 2007, I wouldnt have made much of its generic tone, or of the precise, box-ticking quality of its critical observations.Eugene, serious and somewhat solemn, had been listening with bemusement. I would not cut and paste like he did, because Im a lot more paranoid, he said. Hes a couple of years younger than Alex and was in high school when ChatGPT was released. At the time, he experimented with A.I. for essays but noticed that it made easily noticed errors. This passed the A.I. detector? he..."},{"id":"node_31","title":"New England Is China, by Eileen Chang","url":"https://harpers.org/archive/2025/07/new-england-is-china-eileen-chang-travelogue/","cluster":2,"position":{"x":10.004973411560059,"y":4.038455009460449},"keywords":["a Chinese painting scroll","Tags Anecdotes China Confucius Description","china adjust","Hong Kong","chang"],"content_preview":"July 2025 Issue [Readings] New England Is China Adjust Share by Eileen Chang, From Time Tunnel, which will be published next month by New York Review Books. Composed in 1958, this essay was discovered...","content":"July 2025 Issue [Readings] New England Is China Adjust Share by Eileen Chang, From Time Tunnel, which will be published next month by New York Review Books. Composed in 1958, this essay was discovered in a University of Maryland archive in 2020. Snow-covered New England unrolled endlessly in the bus window like a Chinese painting scroll: bare trees and stripped woods done in black ink with a half-dry brush on the blank space of white sky and snow. Now and then in the distance the misty shadow of a mountain. I have seen places in China which look like our paintings but never so many miles of pure uninterrupted landscape, Subscribe or log in to continue reading. Tags Anecdotes China Confucius Description and travel Hong Kong New England Social life and customs"},{"id":"node_32","title":"https://open.substack.com/pub/samkriss/p/in-my-zombie-era?r=9hfkx&utm_medium=ios","url":"https://open.substack.com/pub/samkriss/p/in-my-zombie-era?r=9hfkx&utm_medium=ios","cluster":0,"position":{"x":9.572673797607422,"y":3.0729241371154785},"keywords":["my zombie eraThe","the senseless rubble","bridges","This sus ahh Ohio ahh realm","the brickwork"],"content_preview":"In my zombie eraThe third stage of culture in the age of infinite informationSam KrissJul 02, 2025313ShareChat, am I washed? Chat, be fr, am I washed? I think I might be washed. I think they might hav...","content":"In my zombie eraThe third stage of culture in the age of infinite informationSam KrissJul 02, 2025313ShareChat, am I washed? Chat, be fr, am I washed? I think I might be washed. I think they might have washed me. But chat, who washed me? Chat, who dried me? Chat, who tucked me up in bed?Every day I spawn in. Emerge wriggling out my skibidi bolus of slime. Whence and where? Lol. Idk. Vibes here be mad shady fr. Shit is not aesthetic. Shit is not bussin. Shit is burned-out cars piled in barricades across the street. Shit is THE END IS NIGH scrawled across bridges. Shit is roofs caved in, windows boarded, thin trees already rising out the wreckage, with roots that slip through gaps in the brickwork to return the brief work of man to the senseless rubble that came before. This sus ahh Ohio ahh realm is my crib. Damn, bitch, I live like this.I am not built different. Ima keep it a stack I am not even tryna be above it. I pull up swagless into this sauceless void. Chat, in what consists my drip? My drip is stiff with blood and mire. Chat, in what consists my aura? My aura is only fear. Chat, in what consists my rizz? My rizz is a half-turned head, twisted birdlike. My rizz is the empty circling of a dislocated jaw. My rizz is antic snarling. My rizz is reddened eyes.Heres a normal day in the life of a mf with zero inner monologue and zero ability to speak. From 6 to 7 am I bedrot, or I would if I had a bed. Instead I simply rot. Goblincore. Mushroomcore. Livid colonies of fungus going feral around my wounds fr. From 7 to 8 am I bedrot. From 8 to 9 am I bedrot. From 9 to 10 am I flail my arms around while making strangled hacking noises. No cap this is such a dope part of my morning routine. From 10 am until lunch I enter grind mode, by which I mean wandering in loose circles over the ruins. For lunch I secure the bag by fanum taxing a stray cat. Mukbang mode. Gristle ASMR. In the afternoon I stay on my sigma hustle grindset by loping aimlessly through the wreckage of a world I do not understand. Ready to smoke an opp. After work I decompress by uttering unearthly screams.I have no bitches. I am bitchless. Kissless, hugless, handholdless, eyecontactless. All my homies get zero pussy. We squad up, but not for warmth or comfort. I would be a volcel if I had any volition, but ngl the force that powers my perambulations is unknown to me fr. I am a lurchcel. I am a shamblecel. I am a teeth rotting in my mouthcel. I am a feet torn to purple-bruising tatterscel. I am an infinite lack of wantingcel. I am post-horny. Nofap without trying. Noclipping out of my libido. Epsilon male. NPC. Im giving either Stoic or leper. I do not long. I do not yearn. I feel no strong emotions. I dont feel anything at all. L  ratio  no life  not caught a single dub  no longer human  I snatch small twitching things out of the undergrowth to devour their flesh and viscera still raw, as the last few pumps of hot metallic blood spurt feebly in my face.I twitch. Muscular spasms, hands taloned at ungodly angles. I stream. Vomiting bile or pissing where I stand. I doomscroll. I have doomscrolled over this entire island, over gentle green hills and through the grey wreck of cities, down to the infinite sea, and none of it has held my attention for even a moment, because I have no attention to hold. I am brainrotted. Molten black sludge in my cranium. I am locked in on the emptiness behind all phenomenal things. Frfr. Bet.But despite the stagnant pond inside me, chat, lowkey theres sometimes a presence that yeets me gibbering across the land, and no cap, that presence, chat, is you. Sometimes, chat, I be surrounding you in your fortified farmhouses. Lacerate my arm tryna reach through the windows, to you. Gyatt! To creak and groan so long without that gyatt! Sometimes, chat, I highkey be chasing you down in the fields. Fall on you and straight up devour your flesh, until you are like me: ungyatted; mid. What I want in you is that you are unlike me. Until I sink my teeth into your body, you are the chat I know to whisper around me on all sides in the depths of my inner night. Chat observes. Chat gives me views and subs. Chat likes, comments, and shares. Your eyes are not like mine. They hit different. Which is deadass why you, chat, are the only ones to whom I can direct my question.Chat, am I washed? Chat, I think I might have been washed. Someone washed me. Someone dried me. Someone tucked me up in bed. But chat, who washed me? Chat, who dried me? Chat, who tucked me up in bed?(Midway through Danny Boyles original 28 Days Later, our heroes escape London and pass through the ruins of Waverley Abbey, destroyed in 1536 during the dissolution of the monasteries. Its peaceful there. Horses run free by the lake. A moment to reflect on what it means to be the last thinking people on an island of the infected and the dead. Youll never hear another piece of original music ever again. Youll never read a book that hasnt already been written. Or see a film that ..."},{"id":"node_33","title":"The Way We Live Now | The New Yorker","url":"https://www.newyorker.com/magazine/1986/11/24/the-way-we-live-now-susan-sontag","cluster":1,"position":{"x":9.613059043884277,"y":2.257415294647217},"keywords":["a serious illness","his lungs","his doctor","smoking","cigarettes"],"content_preview":"Save this storySave this storySave this storySave this storyIllustration by Dadu ShinAt first he was just losing weight, he felt only a little ill, Max said to Ellen, and he didnt call for an appointm...","content":"Save this storySave this storySave this storySave this storyIllustration by Dadu ShinAt first he was just losing weight, he felt only a little ill, Max said to Ellen, and he didnt call for an appointment with his doctor, according to Greg, because he was managing to keep on working at more or less the same rhythm, but he did stop smoking, Tanya pointed out, which suggests he was frightened, but also that he wanted, even more than he knew, to be healthy, or healthier, or maybe just to gain back a few pounds, said Orson, for he told her, Tanya went on, that he expected to be climbing the walls (isnt that what people say?) and found, to his surprise, that he didnt miss cigarettes at all and revelled in the sensation of his lungs being ache-free for the first time in years. But did he have a good doctor, Stephen wanted to know, since it would have been crazy not to go for a checkup after the pressure was off and he was back from the conference in Helsinki, even if by then he was feeling better. And he said, to Frank, that he would go, even though he was indeed frightened, as he admitted to Jan, but who wouldnt be frightened now, though, odd as that might seem, he hadnt been worrying until recently, he avowed to Quentin, it was only in the last six months that he had the metallic taste of panic in his mouth, because becoming seriously ill was something that happened to other people, a normal delusion, he observed to Paolo, if one was thirty-eight and had never had a serious illness; he wasnt, as Jan confirmed, a hypochondriac. Of course, it was hard not to worry, everyone was worried, but it wouldnt do to panic, because, as Max pointed out to Quentin, there wasnt anything one could do except wait and hope, wait and start being careful, be careful, and hope. And even if one did prove to be ill, one shouldnt give up, they had new treatments that promised an arrest of the diseases inexorable course, research was progressing. It seemed that everyone was in touch with everyone else several times a week, checking in, Ive never spent so many hours at a time on the phone, Stephen said to Kate, and when Im exhausted after the two or three calls made to me, giving me the latest, instead of switching off the phone to give myself a respite I tap out the number of another friend or acquaintance, to pass on the news Im not sure I can afford to think so much about it, Ellen said, and I suspect my own motives, theres something morbid Im getting used to, getting excited by, this must be like what people felt in London during the Blitz. As far as I know, Im not at risk, but you never know, said Aileen. This thing is totally unprecedented, said Frank. But dont you think he ought to see a doctor, Stephen insisted. Listen, said Orson, you cant force people to take care of themselves, and what makes you think the worst, he could be just run down, people still do get ordinary illnesses, awful ones, why are you assuming it has to be that. But all I want to be sure, said Stephen, is that he understands the options, because most people dont, thats why they wont see a doctor or have the test, they think theres nothing one can do. But is there anything one can do, he said to Tanya (according to Greg), I mean what do I gain if I go to the doctor; if Im really ill, hes reported to have said, Ill find out soon enough.And when he was in the hospital, his spirits seemed to lighten, according to Donny. He seemed more cheerful than he had been in the last months, Ursula said, and the bad news seemed to come almost as a relief, according to Ira, as a truly unexpected blow, according to Quentin, but youd hardly expect him to have said the same thing to all his friends, because his relation to Ira was so different from his relation to Quentin (this according to Quentin, who was proud of their friendship), and perhaps he thought Quentin wouldnt be undone by seeing him weep, but Ira insisted that couldnt be the reason he behaved so differently with each, and that maybe he was feeling less shocked, mobilizing his strength to fight for his life, at the moment he saw Ira but overcome by feelings of hopelessness when Quentin arrived with flowers, because anyway the flowers threw him into a bad mood, as Quentin told Kate, since the hospital room was choked with flowers, you couldnt have crammed another flower into that room, but surely youre exaggerating, Kate said, smiling, everybody likes flowers. Well, who wouldnt exaggerate at a time like this, Quentin said sharply. Dont you think this is an exaggeration. Of course I do, said Kate gently, I was only teasing, I mean I didnt mean to tease. I know that, Quentin said, with tears in his eyes, and Kate hugged him and said well, when I go this evening I guess I wont bring flowers, what does he want, and Quentin said, according to Max, what he likes best is chocolate. Is there anything else, asked Kate, I mean like chocolate but not chocolate. Licorice, said Quentin, blowing his nose. And besides that. Arent y..."},{"id":"node_34","title":"China’s dreamers and dropouts: ‘lying flat’ generation checks out in Dali","url":"https://www.ft.com/content/34d0e495-31a6-45f5-929e-d46ba95fdbf6","cluster":4,"position":{"x":7.4779887199401855,"y":1.4687352180480957},"keywords":["please enable javascript","check your connection","load","different browser","try using"],"content_preview":"JavaScript is disabled in your browser. Please enable JavaScript to proceed. A required part of this site couldnt load. This may be due to a browser extension, network issues, or browser settings. Ple...","content":"JavaScript is disabled in your browser. Please enable JavaScript to proceed. A required part of this site couldnt load. This may be due to a browser extension, network issues, or browser settings. Please check your connection, disable any ad blockers, or try using a different browser."},{"id":"node_35","title":"Tegmark Group","url":"https://tegmark.org/","cluster":4,"position":{"x":7.778499603271484,"y":2.7495250701904297},"keywords":["the Tegmark AI Safety Group","other powerful AI systems","our Mechanistic Interpretability research","a single AI","Mechanistic Interpretability Ziming Liu"],"content_preview":"Welcome to the Tegmark AI Safety Group! Are you excited about AI but concerned about humanity losing control of it? Then please consider collaborating with our group! Our main focus is on mechanistic ...","content":"Welcome to the Tegmark AI Safety Group! Are you excited about AI but concerned about humanity losing control of it? Then please consider collaborating with our group! Our main focus is on mechanistic interpretability (MI): given a trained neural network that exhibits intelligent behavior, how can we figure out how it works, preferably automatically? Todays large language models and other powerful AI systems tend to be opaque black boxes, offering few guarantees that they will behave as desired. In order of increasing ambition level, here are our three motivations: Diagnose trustworthiness Improve trustworthiness Guarantee trustworthiness For 2) and 3), we work on techniques for automatically extracting the knowledge learned during training. For 3), we are interested in how to reimplementation the extracted knowledge and algorithms in a computational architecture where we can formally verify that it will do what we want. In addition to these efforts, which support alignment of a single AI to its user, we are also interested in game-theory and mechanism design useful for multi-scale alignment (incentivizing people, companies, etc to use AI in ways furthering the common good). Members Max Tegmark PI Website  Twitter Ziming Liu PhD student Website  Twitter Eric J. Michaud PhD student Website  Twitter David D. Baek PhD student Website  Twitter Josh Engels PhD student Website  Twitter Subhash Kantamneni Masters student Twitter Research Below are examples of our Mechanistic Interpretability research so far, which includes auto-discovering knowledge representations, hidden symmetries, modularity and conserved quantities. Youll find a complete list of our publications here. Seeing is Believing: Brain-Inspired Modular Training for Mechanistic Interpretability Ziming Liu, Eric Gan, Max Tegmark arXiv  GitHub  Colab Demo To make neural networks more like brains, we embed neurons into a geometric space and maximize locality of neuron connections. The resulting networks demonstrate extreme sparsity and modularity, which makes mechanistic interpretability much easier. The Quantization Model of Neural Scaling Eric J. Michaud, Ziming Liu, Uzay Girit, Max Tegmark arXiv  GitHub We develop a model of neural scaling laws where a Zipf distribution over discrete subtasks translates into power law scaling in the number of network parameters and the amount of training data. Omnigrok: Grokking Beyond Algorithmic Data Ziming Liu, Eric J. Michaud, Max Tegmark ICLR 2023 (Spotlight) arXiv  GitHub We understand the phenomenon of grokking in neural networks in terms of the interplay between generalization and network weight norm, and use this understanding to control grokking: we can induce grokking (delay generalization) in a wide range of tasks and reduce grokking (accelerate generalization) on algorithmic tasks. Towards Understanding Grokking: An Effective Theory of Representation Learning Ziming Liu, Ouail Kitouni, Niklas Nolte, Eric J. Michaud, Max Tegmark, Mike Williams ICLR 2023 (Spotlight) arXiv  GitHub We study the relationship between generalization and the formation of structured representations in neural networks trained on algorithmic tasks. This website is based on a template by Jon Barron"},{"id":"node_36","title":"Chris Dating Info -- colah's blog","url":"https://colah.github.io/personal/dating/","cluster":3,"position":{"x":8.342791557312012,"y":3.3510704040527344},"keywords":["a Google doc","Chris Dating Info Male","my personal essays","life","a family"],"content_preview":"Chris Dating Info Male, Straight, Monogamous, Wants Kids, SF but flexible, born 1992 This profile was published in August 2022; Im no longer single, but wanted to leave it up since it was an important...","content":"Chris Dating Info Male, Straight, Monogamous, Wants Kids, SF but flexible, born 1992 This profile was published in August 2022; Im no longer single, but wanted to leave it up since it was an important document for me. I originally shared this date me doc as a Google doc on twitter. It got more attention than expected. Unfortunately, the level of traffic seems to have caused Google docs to flag it as spam. As a result, Ive moved it here for longer term preservation. Most of my life has been focused on trying to do things I believe are important. When I was 18, I dropped out of university to support a friend accused of terrorism, because I believe its most important to support people when others dont. When he was found innocent, I noticed that deep learning was going to affect society, and dedicated myself to figuring out how humans could understand neural networks. Ive spent the last decade working on that because I think it could be one of the keys to making AI safe. Serving others and working on important problems is a privilege, but it isnt the only thing I want in life. More than almost anything, I want to have a family: to have a partner and children to share life with. Ive been lucky to date several wonderful women, but its always turned out we werent quite looking for the same things. And so I wanted to try an experiment: simply trying to describe myself and the life I hope to build with a partner as earnestly, openly, and honestly as I possibly can, so that someone can reach out if what Ive written resonates. Pros (at least for the right person!) I think a lot of the best parts of me are seen in what I create: my research, my personal essays, and the journal I founded. Im really excited to have kids with the right partner someday. Im not just willing to have kids. Id be an enthusiastic co-parent whos genuinely eager to do half of childrearing. Im happy to be the primary person responsible for financially supporting a family. This one feels awkward to express, and I worry it might carry connotations about gender roles that I very much dont intend. Im very happy to share financial responsibility! And I can also imagine a relationship with someone who was pursuing, say, a non-profit or academic career that would be hard to support a family on where Id be delighted to remove any difficult tradeoffs. Im very dedicated to doing what I believe to be morally right. I think some people find me frustratingly scrupulous, but I think for others I can help them feel supported in holding true to their own values (even when we differ). Cons I have mild issues with anxiety. I often irrationally worry that people dont like me. In relationships, I worry a lot about not being good enough and my partner leaving me. I also find it hard to be spontaneous, or to go to large social events. Im very self-aware about all of these things and am generally able to manage them fairly well, but you would see them in a relationship. Im not very assertive and have to really push myself to have important disagreements. This is the flip side of me being highly agreeable. I know that having conflict is important, and I can force myself to have difficult conversations, but Im often slow to do so and find it difficult. A surprising contrast to this point: I think Im actually very good at standing up for what I believe in. For example, as mentioned above, I dropped out of university to support someone facing serious terrorism charges because I thought they were innocent. We might be compatible if We have shared sources of excitement. A big part of my experience of life is being excited (or having other strong feelings) about things: the beauty of math and science, the desire to build a wholesome life, the drive to help others, the dream of having a family someday Sharing some of those feels like a powerful foundation for a bond. You are excited about some technical subject (math, science, economics...). I especially love when I can talk to someone about something where theyre much more knowledgeable than me. And especially when they have lots of enthusiasm and excitement about their topic. You share an aspiration to be high-integrity in certain ways, such as being honest even when its hard, being genuinely truth-seeking, being morally independent (you decide on your own moral views rather than adopting a social or political movements unreflectively), and being willing to be wrong. To be clear, Im not some perfect paragon of these values myself! But I tend to feel a lot of connection, trust, and respect when I aspirationally share these values with someone. Other Important Things Im monogamous - Im glad other people enjoy polyamory, but it isnt for me. Im looking to have biological kids - Im really excited to have kids someday and am looking for someone else who is. This doesnt have to be soon! Im very flexible about timelines and could easily imagine anything between 3-8 years. My main concern is having time to build a close relationship t..."},{"id":"node_37","title":"Multimodal Neurons in Artificial Neural Networks","url":"https://distill.pub/2021/multimodal-neurons/","cluster":1,"position":{"x":10.3848237991333,"y":1.805474877357483},"keywords":["Distill"],"content_preview":"Distill...","content":"Distill"},{"id":"node_38","title":"Monocle’s Quality of Life Survey 2025: The 10 most liveable cities in the world","url":"https://monocle.com/affairs/urbanism/quality-of-life-survey-2025/","cluster":2,"position":{"x":10.885482788085938,"y":3.6336257457733154},"keywords":["Pariss city council","the French capitals","Paris","whose ambitious (and, sometimes, controversial) urbanism interventions","the Hôtel de Ville"],"content_preview":"1.ParisBest all-rounderOur city of the year. The French capitals strengths are multitude. I can honestly say that theres no city in the world in which I would rather live, says Charles-Antoine Depardo...","content":"1.ParisBest all-rounderOur city of the year. The French capitals strengths are multitude. I can honestly say that theres no city in the world in which I would rather live, says Charles-Antoine Depardon, an architect and advisor on urban development to Pariss city council, as he strolls through the Tuileries on his way to work at the Hôtel de Ville. It is an extraordinary cocktail. Depardon might be biased but on a spring morning, as the French capitals avenues resound to the click-clack of hard leather shoes on spruce concrete, its hard to argue with him. Last years Olympics provided Paris with the platform to showcase its chic 21st-century self. The city delivered a rousing performance that also served as a fitting coda to a decade of revival under mayor Anne Hidalgo, whose ambitious (and, sometimes, controversial) urbanism interventions have made it cleaner, greener and safer, while maintaining and protecting the things that give it its inimitable charm. Paris in the 21st century looks a lot like it did in the 20th century but thats a large part of the appeal. And today it is also a more international, outward-looking city than it has ever been. One of the most notable changes has been the huge expansion of the cycle-lane network, which led to bike usage doubling between 2023 and 2024, and the overhaul of the once-creaking Métro, the backbone of which is the speedy new Line 14. This takes passengers from Paris-Orly Airport in the south to the new Saint-Denis Pleyel station in the north in just 40 minutes. Meanwhile, in its bid to become the greenest major city in Europe, Paris has embarked on a gargantuan effort to plant 170,000 trees by 2026. At the time of writing, more than 120,000 are in the ground, many of which will be used to cultivate new urban forests, such as the one inaugurated in June 2024 at the Place de Catalogne. Paris is a far more pleasant place to live today, says Lindsey Tramuta, a journalist who hosts a podcast called The New Paris and has called the 11th arrondissement home for 19 years. It was always a beautiful city to walk in but thats even more the case now. When Baron Haussmann reimagined Paris in the 19th century, he made its streets more spacious and airy, and therefore less susceptible to disease and crime. Today there remains a steadfast commitment to prioritising quality over quantity when it comes to designing the urban environment. The draw of the citys cultural behemoths  such as the recently renovated Tadao Ando-designed Bourse de Commerce  remains world-beating, as does its retail prowess. All of this, combined with the policies of the countrys most pro-business president in a long time, has helped Paris to draw and foster enough talent to snatch Londons double crown as Europes top venture-capital city and its leading technology hub. Paris lends itself far more to an office-based culture than cities such as San Francisco or London, says Jordane Giuly, the founder of fintech company Defacto. He points out that the French capitals gentle density is conducive to cross-pollination between start-ups and preferable to the vast distances that one needs to traverse in its rivals. That said, even with the recent business boom, property prices in Paris have fallen over the past two years. Though some areas remain pricey, the city has largely kept its soul, in large part due to housing policies that have helped to keep low-income residents and their businesses in the heart of the city. More than a quarter of Pariss inhabitants live in social housing, while small businesses, such as neighbourhood butchers and the citys famous independent bookshops, have benefited from measures protecting their existence. This idea of mixité sociale (socially and economically diverse districts) has also helped to inject new life and dynamism into a gastronomic scene that had begun to feel threatened by rivals  and now some waiters, like many of the new business owners, are even happy to speak English. Cest la vie! 1. Population: 2,048,472 (metro: 12,271,794) 2. Average working week: 35 hours (mandated by French law)3. Number of Michelin-starred restaurants: 123 4. Cycle lanes: more than 1,000km5. Number of museums within city limits: 136 Click here to enjoy the full Monocle city guide to Paris Our Quality of Life Conference, which this year takes place in Barcelona, assembles the worlds boldest thinkers, industry leaders and creative talent for a real conversation on the things that matter to us all. Click here for more information and tickets. 2.MadridBest for healthA favourable worklife balance and delicious food are a winning formula in the Spanish capital. On a sunny Friday morning in late May, Madrileños of all ages roam the counters at Mercado de la Paz, browsing fresh fish caught that morning, glowing red tomatoes and cheese from all four corners of the country. This Salamanca institution is one of dozens of mercados in the Spanish capital  food markets found in almost every neighbourhood tha..."},{"id":"node_39","title":"AI learns to reason (or does it?)","url":"https://aiguide.substack.com/p/ai-learns-to-reason-or-does-it","cluster":4,"position":{"x":7.374011516571045,"y":2.917847156524658},"keywords":["human reasoning","reasoning abilities","Artificial Intelligence Learns","ai learns","The Metaphors of Artificial Intelligence, Science"],"content_preview":"AI learns to reason (or does it?)Melanie MitchellMar 21, 20251421710ShareI have a gig writing four columns a year about artificial intelligence for Science Magazines Expert Voices project. These colum...","content":"AI learns to reason (or does it?)Melanie MitchellMar 21, 20251421710ShareI have a gig writing four columns a year about artificial intelligence for Science Magazines Expert Voices project. These columns are non-technical and meant to be accessible to a general science-interested audience. My latest column is about large reasoning modelsmodels based on LLMs but specially trained to reason. These include systems like OpenAIs o1 and o3 models, as well as DeepSeeks R1 model, among others. This approach has been getting a lot of buzz in the AI world, and has had some really impressive success on several benchmarks meant to test reasoning abilities. How do these models work? Are they genuinely reasoning, or merely mimicking the patterns of human reasoning that they are trained on? And what exactly is reasoning, anyway? Check out this column for some of my answers to these questions:Artificial Intelligence Learns To Reason, Science, March 20, 2025And let me know your comments and questions!P.S. In case you missed them, here are my previous Science Expert Voices columns:The Metaphors of Artificial Intelligence, Science, November 14, 2024The Turing Test and Our Shifting Conceptions of Intelligence, Science, August 15, 2024Debates on the Nature of Artificial General Intelligence, Science, March 21, 2024AIs Challenge of Understanding the World, Science, November 10, 2023How Do We Know How Smart AI Systems Are?, Science, July 13, 20231421710Share"},{"id":"node_40","title":"https://www.metropolitanreview.org/p/model-collapse?r=9hfkx&utm_medium=ios&utm_campaign=audio-player","url":"https://www.metropolitanreview.org/p/model-collapse?r=9hfkx&utm_medium=ios&utm_campaign=audio-player","cluster":1,"position":{"x":8.93019962310791,"y":2.6094796657562256},"keywords":["the screenwriter","the actor","their own unfiltered biopics","a movie","the writer"],"content_preview":"Film  TelevisionModel CollapseOn Jesse Armstrongs MountainheadKatya Grishakova and The Metropolitan ReviewJun 25, 202559108SharePablo Picasso, Man Holding a Sheep, Flutist, and Heads, 1967, Colored cr...","content":"Film  TelevisionModel CollapseOn Jesse Armstrongs MountainheadKatya Grishakova and The Metropolitan ReviewJun 25, 202559108SharePablo Picasso, Man Holding a Sheep, Flutist, and Heads, 1967, Colored crayons and pencils, with smudging, on wove paperA peculiar development is on hand. The people in power, the people who make the news and shape history, no longer want to wait for someone to play them, years later, in a movie; they want to play themselves, now, live on TV, with dramatic flair. They imagine how they should be perceived by the audience and they deliver to us that perceived character. Our Defense Secretary imagines what a Defense Secretary should be like and plays that version on TV. Our Attorney General plays her version of Attorney General. Trump, of course, plays Trump. They all decided to cut out the middleman  the historian, the biographer, the screenwriter, the actor  and deliver their own unfiltered biopics straight to the consumer. This M.O. doesnt require much effort to conceive and execute, its a good tool to build your personal brand, and, as a fortuitous side effect, it has defanged the whole satire genre. How do you mock power when it acts like a bad-dream Monty Python skit?On top of that, things are moving fast. Jesse Armstrong, the writer and director of HBOs Mountainhead  a satire about four tech oligarchs whose whims and products make the world burn  mustve watched with dismay at how the timeline made his artistic efforts obsolete before he even wrote down EXT. SNOWY MOUNTAINSIDE. Armstrong wrote the screenplay for an almost two-hour movie in January, started shooting in March, made edits in April, and released it in May. During that time, just to take a cursory look at world events: the US President threatened Canada and Greenland with invasion; a US ally was mocked and humiliated by the President and the Vice President on live TV; markets plunged, then recovered based on a presidential tweet; a rogue billionaire and his team of twenty-year-olds wrecked crucial government agencies; and the US credit rating got downgraded. The day before the movie was released, Elon Musk, the richest man in the world and an inspiration behind some of the characters, stopped by the Oval Office high on ketamine, with a shiner on his right eye, apparently given to him by our Treasury Secretary Scott Bessent (a southpaw!), in an altercation over DOGE failings. And less than a week later, Musk had an acrimonious, shit-hurling falling-out with the man he spent a quarter of a billion dollars on making President just months earlier. I mean, what can a fiction writer even do here?In Mountainhead, four tech bros arrive at a sprawling modernist chalet in snow-covered Utah mountains for some RR: a poker game, an intellectual salon with no deals, no meals, no high heels (that is no shop talk, no household help, no women) as distractions.Theres Venis (Cory Michael Smith), the owner of a social media platform and the richest man in the world. The platform, called Traam, has just released a new feature that allows users to create high-quality deepfakes. Within hours of its release, it is unleashing planetary-wide chaos. Venis general attitude to seeing the world burn on his phone screen is a shrug and a cackle. Nothing is fucking serious, and everything is funny and cool. He wishes, however, that he could get off this rock someday.Jeff, played by Ramy Youssef, owns an AI company. Its main technology has the capacity to fact-check the news and thus curb spreading political and economic turmoil. Venis is interested in buying Jeffs AI company so that he could mitigate the deadly consequences of his recent innovation without admitting error and taking responsibility. Jeffs AI has another potential: Venis and Randall (Steve Carell) believe that it can usher, within five to ten years, a transhumanist future.Randall is the graybeard of the group. Were never quite told what he does, but it is clear that hes some kind of a hedge fundVC guy, a dark-money Gandalf. He knows everything about credit ratings and bond markets and strategic reserves, he throws around words like de minimis (finance guys do that), and his worldview, unlike that of the other three, has solid philosophical underpinnings. It is Hegelian dialectic that, in his interpretation, is transformed into the triad Fuck! What? Cool! Fuck!  thats peoples initial reaction to an innovation; What?  a subsequent reevaluation; and Cool!  an eventual acceptance. Randall also has an incurable cancer, and is particularly interested in continuing his existence in digital form.The poorest of them all is Soups (Jason Schwartzman), the owner of a meditation app. His net worth is a mere five hundred million, a soup-kitchen-level poverty in the realm of billionaires (thus the nickname, Soups). Jesse Armstrong has a talent for exploring the pecking order of the rich, and I was reminded of a Succession episode where a character described an income of five million dollars as a nigh..."},{"id":"node_41","title":"How Debt Ate Chicago","url":"https://www.city-journal.org/article/how-debt-ate-chicago","cluster":0,"position":{"x":10.943946838378906,"y":3.3181817531585693},"keywords":["Tougher Policing","Judge Glock","a dire police shortage","Chicago","public safety"],"content_preview":"Judge Glock How Debt Ate Chicago Mounting liabilities are the greatest threat to the citys survival.  States and Cities, Economy, Finance, and Budgets, Politics and Law June 02, 2024  Share  From the ...","content":"Judge Glock How Debt Ate Chicago Mounting liabilities are the greatest threat to the citys survival.  States and Cities, Economy, Finance, and Budgets, Politics and Law June 02, 2024  Share  From the Magazine  States and Cities, Economy, Finance, and Budgets, Politics and Law Spring 2024  Share A fight broke out late one Saturday night, or, more accurately, early Sunday morning, at a bar on Chicagos South Side. Someone called the police just after 4:30 am. But the police didnt come. The fight soon moved outside; one man issued a threat, got into his car, and then plowed it into the crowd, just before five oclock. Three people were killed. Still no police. An officer wasnt dispatched until 5:20 and didnt arrive until more than an hour after the original call. Chicago faces a dire police shortage. (See Can We Get Back to Tougher Policing?,) Over half of high-priority 911 calls had no cops available to respond. One important reason is that the city is now allocating almost half of its budget to debt and pensions, leaving ever less for essential services, including public safety. The municipal government is acting more like a conduit channeling money from residents to check-collectors than a protector of its citizens rights and liberties. Finally, a reason to check your email. Sign up for our free newsletter today. First Name Last Name Email Sign Up This site is protected by hCaptcha and its Privacy Policy and Terms of Service apply. Thank you for signing up! Chicago has dominated Americas heartland since the late nineteenth century. As the City of the Big Shoulders, it has been a place whose self-reliance and drive allowed it to compete with coastal metros boasting more obvious advantages. Chicagos landscape and weather may leave something to be desired, but the citys combination of cosmopolitanism and localism, embodied in its diverse neighborhoods, has helped give it a distinctive American personality. Yet bad services, corrupt politics, and elevated crime have made life in Chicago increasingly unpleasant, all worsened by the citys parlous finances. An ever-mounting debt burden is the greatest threat to the citys survival. As that problem worsens, more residents will question whether they want to stay in a windswept city paying down someone elses pensionor decamp for places that dont place such a millstone around their citizens necks. According to the group Truth in Accounting, Chicago continues to live up to its moniker Second City in at least one respect: it has the second-worst debt load of any big city in Americaabout 43,000 per taxpayer, or almost 40 billion in total. The first is New York City, but Chicago residents also have to deal with Illinois debts, which total 42,000 per taxpayer, third worst in the nation. Thus, a family moving to Chicago suddenly becomes the inheritor of almost 85,000 in liabilities. By this metric, Chicago is no longer second but has by far the worst debt burden of any major city. Chicagos accumulating debt might be bearable if the city had low taxes and therefore room to raise them and pay down some of the liabilities. But taxes in the Windy City already rank among the nations harshest. According to a national study, Chicagos combined city and state taxes would eat up over 12 percent of a U.S. median family income. The only large cities with higher proportionate taxes are Rust Belt towns with much smaller populations, such as Detroit and Newark. Chicago imposes the highest sales tax of any major city (10.25 percent) and punishing property taxes, too. Chicagos taxation is also brutal on businesses. A recent study of 53 cities found that Chicagos tax on industrial properties was nearly double the average of other cities. Chicagos commercial property-tax rate, at more than 4 percent per year, was by far the worst of any major city and more than twice the average. High debt and taxes might be manageable if the citys economic fundamentals were strong. Theyre not. Chicago relied for years on commercial properties, especially downtown offices in the Loop, to power its economy and fund the citys excesses. But those jobs are fleeing. Downtown Chicagos office vacancy rate recently approached 24 percent, a record high. Boeing has moved its headquarters from the Loop to Northern Virginia. These white-collar firms will not pay the citys higher taxes in the future; they wont even pay their existing leases. Despite the citys crushing liabilities, Mayor Brandon Johnson has pledged to boost spending on progressive projects. (Vincent AlbanChicago TribuneTribune News ServiceGetty Images) Making matters worse, Chicagos population is shrinking. Chicago hit its peak population 70 years ago, and it has contracted further since the early 1990s, when many other big cities began to revive. At about 2.7 million people, its still, barely, Americas third-largest city, but its a quarter smaller than it was about a half-century ago. Even if Chicago gets its fiscal house in order, continued population loss ..."},{"id":"node_42","title":"https://open.substack.com/pub/metropolitanreview/p/would-you-rather-have-married-young?r=9hfkx&utm_medium=ios","url":"https://open.substack.com/pub/metropolitanreview/p/would-you-rather-have-married-young?r=9hfkx&utm_medium=ios","cluster":1,"position":{"x":9.247982025146484,"y":3.213594436645508},"keywords":["Married Young?Lena Dunham","Experience lillian fishman","her write","the critically-acclaimed Acts","sexual desire"],"content_preview":"Essays Would You Rather Have Married Young?Lena Dunham, Sally Rooney, and the End of Experience lillian fishman and The Metropolitan ReviewFeb 23, 20252,594159524ShareSaul Leiter, The Village, 1947, P...","content":"Essays Would You Rather Have Married Young?Lena Dunham, Sally Rooney, and the End of Experience lillian fishman and The Metropolitan ReviewFeb 23, 20252,594159524ShareSaul Leiter, The Village, 1947, Photograph, Whitney Museum of American ArtLillian Fishman, author of the critically-acclaimed Acts of Service, is one of the best writers we have right now. It is a treat to have her write for TMR. Its always tricky to write about the depths of sexual desire, and Fishman walks the line with both honesty and class. Please consider pledging 50 for the year or 5 a month to The Metropolitan Review.-The EditorsSubscribeIn an iconic episode of Girls, One Mans Trash, Hannah spontaneously spends a weekend with a hot, respectful doctor in his expensive brownstone. After a couple of sublime days in his house she suffers a moment of shameful envy. Please dont tell anyone this, she says, in tears, but I want to be happy.Doctor: Of course you do. Everyone does.Hannah: But I didnt think that I did. I made a promise such a long time ago that I was going to take in experiences, all of them, so that I could tell other people about them and maybe save them, but it gets so tiring, trying to take in all the experiences for everybody, letting anyone say anything to me. Then I came here and I see you. And youve got the fruit in the bowl and the fridge with the stuff, the robe, youre touching me the way that I realize Im not different, you know? I want what everyone wants, I want what they all want, I want all the things. I just want to be happy.What is that thing Hannah calls happiness while shes ensconced in the doctors house? Financial security, romantic stability, the sense of being safe and cared for. Her usual life is full of assholes, sexual misadventures, broke months, and tedious jobs. The weekend ends awkwardly when the hot doctor grows tired of her, but Hannah dries her tears and waltzes off into that continuing mess of her life, changing nothing. He might protest that everyone wants to be happy; for Hannah this wish is a moment of weakness. Her object in life is to take in experiences, and the object of Girls is to delight in the vast breadth of thrilling and harrowing events which can befall a willing girl in her early twenties in New York. Hannah and Jessa both regularly justify their behavior, as well as their unhappiness, with the conviction that they will one day be, as Jessa wonderfully puts it, fucking fat because Ill be full of experiences.When I started watching Girls, at eighteen years old, freshly arrived in New York City myself, this was the kind of life I wanted. My friends and I had an ideological devotion to experience and a belief in the nobility of independence. We were entirely convinced by the dichotomy Hannah set up in One Mans Trash  that a girl could either be experienced or happy  and it seemed to be confirmed by our knowledge of feminism and our desire to be modern. To choose experience was to choose to be single when you were young, to be willing to undergo some precarity because you had to look out for yourself, to be curious about the characters you would meet and what effect theyd have on you, and to rely on your friends for solace and support. To choose happiness was to try to make a career, a marriage, and a stable life as efficiently as possible: basically, as I saw it, to spit in the face of the great opportunity that women had finally wrested back from the jaws of history.This was the fundamental ethos that had long governed the young secular woman in a big liberal city. Before Girls, in Sex and the City, independence and experience were valued, though with a little more reserve, as precursors to a conventional-ish happiness. The women of Sex and the City (excepting Samantha) wanted husbands, but the glamour of their single lives went a long way in making up for the lack. Fifteen years later, Girls was instead the ultimate advertisement for experience as object, rather than as consolation, even as it made the single life look significantly more disturbing than it had looked on Sex and the City. And that depiction of experience as object was electrifying. It seemed to free us from thinking of dates as tests to be passed, or of our lives as escalators we were obligated to ride up. I knew some day most of us would seek more stability, get married, and have kids, but I never doubted that wed be glad wed had some dangerous fun when we were younger. That was how one learned to charm, to fall in love, to work, to feed a hangover, to survive a variety of small-time ordeals. That was the crucible of adulthood.This is why the most shocking piece of writing in recent contemporary fiction is, to my mind, not any of the sexually explicit or morally disturbing stories we have come to expect, but this short passage from Sally Rooneys third novel, Beautiful World, Where Are You. In an email to her friend Alice, Eileen discusses her childhood neighbor Simon, with whom she has had an on-and-off-again romance..."},{"id":"node_43","title":"The Evidence So Far: What Research Reveals About AI’s Real Impact on Jobs and Society | American Enterprise Institute - AEI","url":"https://www.aei.org/technology-and-innovation/the-evidence-so-far-what-research-reveals-about-ais-real-impact-on-jobs-and-society/","cluster":4,"position":{"x":7.640804290771484,"y":2.617265224456787},"keywords":["the 2025 AI Index Report","AI Innovation","Chinas AI Strategy","integrate new ai","The AI Race Accelerates"],"content_preview":"As organizations race to integrate new AI models into their workflows, everyone is wondering what the effects will be on industries, jobs, and society: Will these new technologies complement human cap...","content":"As organizations race to integrate new AI models into their workflows, everyone is wondering what the effects will be on industries, jobs, and society: Will these new technologies complement human capabilities, create new opportunities, or replace workers across various sectors? The following table compiles research on large language models (LLMs), chatbots, and AI systems published since ChatGPT 3.5s late 2022 debut. It will be periodically refreshed with new studies that explore how these technologies are transforming industries, reshaping employment patterns, and impacting society. Learn more: Chinas AI Strategy: Adoption Over AGI  The AI Race Accelerates: Key Insights from the 2025 AI Index Report  Lessons from Chinas DeepSeek: A Wake-Up Call for AI Innovation  My AI Advisers: Lessons from a Year of Expert Digital Assistants Thank you for your submission. Related Post May 08, 2025 AEIdeas Chinas AI Strategy: Adoption Over AGI By Will Rinehart Post April 15, 2025 AEIdeas The AI Race Accelerates: Key Insights from the 2025 AI Index Report By John Bailey Post February 07, 2025 AEIdeas Lessons from Chinas DeepSeek: A Wake-Up Call for AI Innovation By John Bailey Post February 03, 2025 AEIdeas My AI Advisers: Lessons from a Year of Expert Digital Assistants By John Bailey"},{"id":"node_44","title":"https://arxiv.org/pdf/2505.23735","url":"https://arxiv.org/pdf/2505.23735","cluster":1,"position":{"x":7.022555828094482,"y":3.593597650527954},"keywords":["arXiv GenPDF","tex2pdf:)) DOI","pikepdf","R Names 4 0 R OpenAction 5 0 R Outlines","R Resources"],"content_preview":"PDF-1.5  1 0 obj  Metadata 3 0 R Names 4 0 R OpenAction 5 0 R Outlines 6 0 R PageMode UseOutlines Pages 7 0 R Type Catalog  endobj 2 0 obj  Author (Ali Behrouz; Zeman Li; Praneeth Kacham; Majid Daliri...","content":"PDF-1.5  1 0 obj  Metadata 3 0 R Names 4 0 R OpenAction 5 0 R Outlines 6 0 R PageMode UseOutlines Pages 7 0 R Type Catalog  endobj 2 0 obj  Author (Ali Behrouz; Zeman Li; Praneeth Kacham; Majid Daliri; Yuan Deng; Peilin Zhong; Meisam Razaviyayn; Vahab Mirrokni) Creator (arXiv GenPDF (tex2pdf:)) DOI (https:doi.org10.48550arXiv.2505.23735) License (http:creativecommons.orglicensesby4.0) PTEX.Fullbanner (This is pdfTeX, Version 3.141592653-2.6-1.40.25 (TeX Live 2023) kpathsea version 6.3.5) Producer (pikepdf 8.15.1) Title (ATLAS: Learning to Optimally Memorize the Context at Test Time) Trapped False arXivID (https:arxiv.orgabs2505.23735v1)  endobj 3 0 obj  Subtype XML Type Metadata Length 1781  stream ATLAS: Learning to Optimally Memorize the Context at Test TimeAli BehrouzZeman LiPraneeth KachamMajid DaliriYuan DengPeilin ZhongMeisam RazaviyaynVahab Mirroknihttp:creativecommons.orglicensesby4.0cs.CLcs.AI endstream endobj 4 0 obj  Dests 8 0 R  endobj 5 0 obj  D [ 9 0 R Fit ] S GoTo  endobj 6 0 obj  Count 13 First 10 0 R Last 11 0 R Type Outlines  endobj 7 0 obj  Count 31 Kids [ 12 0 R 13 0 R 14 0 R 15 0 R 16 0 R 17 0 R ] Type Pages  endobj 8 0 obj  Kids [ 18 0 R 19 0 R ] Limits [ (AMS.7) (theorem.dummy.5) ]  endobj 9 0 obj  Annots [ 20 0 R 21 0 R 22 0 R 23 0 R 24 0 R 25 0 R 26 0 R 27 0 R 28 0 R 29 0 R 30 0 R 31 0 R 32 0 R 33 0 R 34 0 R 35 0 R 36 0 R 37 0 R 38 0 R 39 0 R 40 0 R 41 0 R 42 0 R ] Contents [ 43 0 R 44 0 R ] Group 45 0 R MediaBox [ 0 0 612 792 ] Parent 12 0 R Resources 46 0 R Type Page  endobj 10 0 obj  A 47 0 R Next 48 0 R Parent 6 0 R Title 49 0 R  endobj 11 0 obj  A 50 0 R Count -1 First 51 0 R Last 51 0 R Parent 6 0 R Prev 52 0 R Title 53 0 R  endobj 12 0 obj  Count 6 Kids [ 9 0 R 54 0 R 55 0 R 56 0 R 57 0 R 58 0 R ] Parent 7 0 R Type Pages  endobj 13 0 obj  Count 6 Kids [ 59 0 R 60 0 R 61 0 R 62 0 R 63 0 R 64 0 R ] Parent 7 0 R Type Pages  endobj 14 0 obj  Count 6 Kids [ 65 0 R 66 0 R 67 0 R 68 0 R 69 0 R 70 0 R ] Parent 7 0 R Type Pages  endobj 15 0 obj  Count 6 Kids [ 71 0 R 72 0 R 73 0 R 74 0 R 75 0 R 76 0 R ] Parent 7 0 R Type Pages  endobj 16 0 obj  Count 6 Kids [ 77 0 R 78 0 R 79 0 R 80 0 R 81 0 R 82 0 R ] Parent 7 0 R Type Pages  endobj 17 0 obj  Count 1 Kids [ 83 0 R ] Parent 7 0 R Type Pages  endobj 18 0 obj  Kids [ 84 0 R 85 0 R 86 0 R 87 0 R 88 0 R 89 0 R ] Limits [ (AMS.7) (page.8) ]  endobj 19 0 obj  Kids [ 90 0 R 91 0 R ] Limits [ (page.9) (theorem.dummy.5) ]  endobj 20 0 obj  A  D (cite.0bahdanau2014neural) S GoTo  Border [ 0 0 0 ] C [ 0 1 0 ] H I Rect [ 231.797 309.839 252.635 321.211 ] Subtype Link Type Annot  endobj 21 0 obj  A  D (cite.0achiam2023gpt) S GoTo  Border [ 0 0 0 ] C [ 0 1 0 ] H I Rect [ 94.903 297.883 115.796 309.256 ] Subtype Link Type Annot  endobj 22 0 obj  A  D (cite.0behrouz2024titans) S GoTo  Border [ 0 0 0 ] C [ 0 1 0 ] H I Rect [ 217.071 297.883 237.965 309.256 ] Subtype Link Type Annot  endobj 23 0 obj  A  D (cite.0team2025gemma) S GoTo  Border [ 0 0 0 ] C [ 0 1 0 ] H I Rect [ 301.569 297.883 322.462 309.256 ] Subtype Link Type Annot  endobj 24 0 obj  A  D (cite.0transformers) S GoTo  Border [ 0 0 0 ] C [ 0 1 0 ] H I Rect [ 388.88 297.883 409.774 309.256 ] Subtype Link Type Annot  endobj 25 0 obj  A  D (cite.0dalal2025one) S GoTo  Border [ 0 0 0 ] C [ 0 1 0 ] H I Rect [ 342.648 250.063 362.801 261.435 ] Subtype Link Type Annot  endobj 26 0 obj  A  D (cite.0li2024survey) S GoTo  Border [ 0 0 0 ] C [ 0 1 0 ] H I Rect [ 430.176 250.063 450.328 261.435 ] Subtype Link Type Annot  endobj 27 0 obj  A  D (cite.0liu2024lost) S GoTo  Border [ 0 0 0 ] C [ 0 1 0 ] H I Rect [ 509.033 250.063 529.185 261.435 ] Subtype Link Type Annot  endobj 28 0 obj  A  D (cite.0behrouz2024titans) S GoTo  Border [ 0 0 0 ] C [ 0 1 0 ] H I Rect [ 540.2 220.175 560.927 231.547 ] Subtype Link Type Annot  endobj 29 0 obj  A  D (cite.0peng2025rwkv7) S GoTo  Border [ 0 0 0 ] C [ 0 1 0 ] H I Rect [ 149.328 208.22 169.981 219.592 ] Subtype Link Type Annot  endobj 30 0 obj  A  D (cite.0schlag2021linear) S GoTo  Border [ 0 0 0 ] C [ 0 1 0 ] H I Rect [ 224.211 208.22 244.864 219.592 ] Subtype Link Type Annot  endobj 31 0 obj  A  D (cite.0behrouz2025Miras) S GoTo  Border [ 0 0 0 ] C [ 0 1 0 ] H I Rect [ 450.138 196.264 470.291 207.637 ] Subtype Link Type Annot  endobj 32 0 obj  A  D (cite.0katharopoulos2020transformers) S GoTo  Border [ 0 0 0 ] C [ 0 1 0 ] H I Rect [ 191.449 160.399 211.601 171.771 ] Subtype Link Type Annot  endobj 33 0 obj  A  D (cite.0schlag2021linear) S GoTo  Border [ 0 0 0 ] C [ 0 1 0 ] H I Rect [ 364.08 160.399 384.233 171.771 ] Subtype Link Type Annot  endobj 34 0 obj  A  D (cite.0sun2023retentive) S GoTo  Border [ 0 0 0 ] C [ 0 1 0 ] H I Rect [ 252.082 148.444 272.864 159.816 ] Subtype Link Type Annot  endobj 35 0 obj  A  D (cite.0behrouz2024titans) S GoTo  Border [ 0 0 0 ] C [ 0 1 0 ] H I Rect [ 488.567 148.444 509.349 159.816 ] Subtype Link Type Annot  endobj 36 0 obj  A  D (cite.0peng2025rwkv7) S GoTo  Border [ 0 0 0 ] C [ 0 1 0 ] H I Rect [ 159.099 136.489 179.715 147.8..."},{"id":"node_45","title":"What Is ChatGPT Doing … and Why Does It Work?—Stephen Wolfram Writings","url":"https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/","cluster":4,"position":{"x":7.283359527587891,"y":2.834719181060791},"keywords":["other current large language models","ChatGPT Doing","human-written text","ChatGPT Work","Computational Language"],"content_preview":"Contents Top Its Just Adding One Word at a Time Where Do the Probabilities Come From? What Is a Model? Models for Human-Like Tasks Neural Nets Machine Learning, and the Training of Neural Nets The Pra...","content":"Contents Top Its Just Adding One Word at a Time Where Do the Probabilities Come From? What Is a Model? Models for Human-Like Tasks Neural Nets Machine Learning, and the Training of Neural Nets The Practice and Lore of Neural Net Training Surely a Network Thats Big Enough Can Do Anything! The Concept of Embeddings Inside ChatGPT The Training of ChatGPT Beyond Basic Training What Really Lets ChatGPT Work? Meaning Space and Semantic Laws of Motion Semantic Grammar and the Power of Computational Language So ... What Is ChatGPT Doing, and Why Does It Work? Thanks Additional Resources What Is ChatGPT Doing  and Why Does It Work? ORDER ONLINE What Is ChatGPT Doing  and Why Does It Work? February 14, 2023 See also: LLM Tech Comes to Wolfram Language A discussion about the history of neural nets  Its Just Adding One Word at a Time That ChatGPT can automatically generate something that reads even superficially like human-written text is remarkable, and unexpected. But how does it do it? And why does it work? My purpose here is to give a rough outline of whats going on inside ChatGPTand then to explore why it is that it can do so well in producing what we might consider to be meaningful text. I should say at the outset that Im going to focus on the big picture of whats going onand while Ill mention some engineering details, I wont get deeply into them. (And the essence of what Ill say applies just as well to other current large language models [LLMs] as to ChatGPT.) The first thing to explain is that what ChatGPT is always fundamentally trying to do is to produce a reasonable continuation of whatever text its got so far, where by reasonable we mean what one might expect someone to write after seeing what people have written on billions of webpages, etc. So lets say weve got the text The best thing about AI is its ability to. Imagine scanning billions of pages of human-written text (say on the web and in digitized books) and finding all instances of this textthen seeing what word comes next what fraction of the time. ChatGPT effectively does something like this, except that (as Ill explain) it doesnt look at literal text; it looks for things that in a certain sense match in meaning. But the end result is that it produces a ranked list of words that might follow, together with probabilities: And the remarkable thing is that when ChatGPT does something like write an essay what its essentially doing is just asking over and over again given the text so far, what should the next word be?and each time adding a word. (More precisely, as Ill explain, its adding a token, which could be just a part of a word, which is why it can sometimes make up new words.) But, OK, at each step it gets a list of words with probabilities. But which one should it actually pick to add to the essay (or whatever) that its writing? One might think it should be the highest-ranked word (i.e. the one to which the highest probability was assigned). But this is where a bit of voodoo begins to creep in. Because for some reasonthat maybe one day well have a scientific-style understanding ofif we always pick the highest-ranked word, well typically get a very flat essay, that never seems to show any creativity (and even sometimes repeats word for word). But if sometimes (at random) we pick lower-ranked words, we get a more interesting essay. The fact that theres randomness here means that if we use the same prompt multiple times, were likely to get different essays each time. And, in keeping with the idea of voodoo, theres a particular so-called temperature parameter that determines how often lower-ranked words will be used, and for essay generation, it turns out that a temperature of 0.8 seems best. (Its worth emphasizing that theres no theory being used here; its just a matter of whats been found to work in practice. And for example the concept of temperature is there because exponential distributions familiar from statistical physics happen to be being used, but theres no physical connectionat least so far as we know.) Before we go on I should explain that for purposes of exposition Im mostly not going to use the full system thats in ChatGPT; instead Ill usually work with a simpler GPT-2 system, which has the nice feature that its small enough to be able to run on a standard desktop computer. And so for essentially everything I show Ill be able to include explicit Wolfram Language code that you can immediately run on your computer. (Click any picture here to copy the code behind it.) For example, heres how to get the table of probabilities above. First, we have to retrieve the underlying language model neural net: Later on, well look inside this neural net, and talk about how it works. But for now we can just apply this net model as a black box to our text so far, and ask for the top 5 words by probability that the model says should follow: This takes that result and makes it into an explicit formatted dataset: Heres what happens if one repeatedly applies..."},{"id":"node_46","title":"The Reenchanted World, by Karl Ove Knausgaard, Translated by Olivia Lasky, Damion Searls","url":"https://harpers.org/archive/2025/06/the-reenchanted-world-karl-ove-knausgaard-digital-age/","cluster":3,"position":{"x":8.14968490600586,"y":3.562211036682129},"keywords":["the digital age","Tags Alienation Artificial intelligence Authors Computers Digital age Gilbert Simondon James Bridle Karl Marx Literature","Essay] The Reenchanted World","a computer","Karl Ove Knausgaard"],"content_preview":"June 2025 Issue [Essay] The Reenchanted World On finding mystery in the digital age by Karl Ove Knausgaard,Translated by Olivia Lasky, Damion Searls, Illustration by Xiao Hua Yang [Essay] The Reenchan...","content":"June 2025 Issue [Essay] The Reenchanted World On finding mystery in the digital age by Karl Ove Knausgaard,Translated by Olivia Lasky, Damion Searls, Illustration by Xiao Hua Yang [Essay] The Reenchanted World On finding mystery in the digital age by Karl Ove Knausgaard,Translated by Olivia Lasky, Damion Searls, Adjust Share The first time I saw a computer was in 1984. I was fifteen years old and living in a sparsely populated area near a river, miles away from the closest town, in a far-northern country at the very edge of the world. A sign lit up above the convenience store that closed at four oclock every day; otherwise, the visual stimuli were limited to fields and trees, trees and fields, and to the cars driving along the roads. In autumn and spring it rained so much that the river overflowed its banksI remember standing in front of the living-room Subscribe or log in to continue reading. Karl Ove Knausgaard is the author of several books, including My Struggle. This essay is part of a series supported by the John Templeton Foundation. Tags Alienation Artificial intelligence Authors Computers Digital age Gilbert Simondon James Bridle Karl Marx Literature in translation Norwegian Philosophy Technology Xiao Hua Yang Dreams of My Father From The Wolves of Eternity, which was published this month by Harvill Secker. That night I dreamt about Dad. I didnt very often, and when I woke up from the A Mutable Feast From Pig Person, an essay in the collection In the Land of the Cyclops, which will be published this month by Archipelago Books. Translated from the Norwegian. Preconceptions are a Only a Game From a letter written by Karl Ove Knausgaard to Fredrik Ekelund, a novelist, in 2014. The letter was included in Home and Away, a collection of their letters about the Adjust Share"},{"id":"node_47","title":"Why We Think | Lil'Log","url":"https://lilianweng.github.io/posts/2025-05-01-thinking/","cluster":4,"position":{"x":7.1472907066345215,"y":3.1166374683380127},"keywords":["Continuous Space Recurrent Architecture Thinking Tokens Thinking","Thinking Time","Slow thinking","a Resource Latent Variable Modeling Thinking","human thinking"],"content_preview":"Table of Contents Motivation Analogy to Psychology Computation as a Resource Latent Variable Modeling Thinking in Tokens Branching and Editing Parallel Sampling Sequential Revision RL for Better Reaso...","content":"Table of Contents Motivation Analogy to Psychology Computation as a Resource Latent Variable Modeling Thinking in Tokens Branching and Editing Parallel Sampling Sequential Revision RL for Better Reasoning External Tool Use Thinking Faithfully Does the Model Tell What it Thinks Faithfully Optimization Pressure on CoT: Good or Bad? Thinking in Continuous Space Recurrent Architecture Thinking Tokens Thinking as Latent Variables Expectation-Maximization Iterative Learning Scaling Laws for Thinking Time Whats for Future Citation References Special thanks to John Schulman for a lot of super valuable feedback and direct edits on this post. Test time compute (Graves et al. 2016, Ling, et al. 2017, Cobbe et al. 2021) and Chain-of-thought (CoT) (Wei et al. 2022, Nye et al. 2021), have led to significant improvements in model performance, while raising many research questions. This post aims to review recent developments in how to effectively use test-time compute (i.e. thinking time) and why it helps. Motivation Enabling models to think for longer can be motivated in a few different ways. Analogy to Psychology The core idea is deeply connected to how humans think. We humans cannot immediately provide the answer for Whats 12345 times 56789?. Rather, it is natural to spend time pondering and analyzing before getting to the result, especially for complex problems. In Thinking, Fast and Slow (Kahneman, 2013), Daniel Kahneman characterizes human thinking into two modes, through the lens of the dual process theory : Fast thinking (System 1) operates quickly and automatically, driven by intuition and emotion while requiring little to no effort. Slow thinking (System 2) demands deliberate, logical thought and significant cognitive efforts. This mode of thinking consumes more mental energy and requires intentional engagement. Because System 1 thinking is fast and easy, it often ends up being the main decision driver, at the cost of accuracy and logic. It naturally relies on our brains mental shortcuts (i.e., heuristics) and can lead to errors and biases. By consciously slowing down and taking more time to reflect, improve and analyze, we can engage in System 2 thinking to challenge our instincts and make more rational choices. Computation as a Resource One view of deep learning, is that neural networks can be characterized by the amount of computation and storage they can access in a forward pass, and if we optimize them to solve problems using gradient descent, the optimization process will figure out how to use these resourcestheyll figure out how to organize these resources into circuits for calculation and information storage. From this view, if we design an architecture or system that can do more computation at test time, and we train it to effectively use this resource, itll work better. In Transformer models, the amount of computation (flops) that the model does for each generated token is roughly 2 times the number of parameters. For sparse models like mixture of experts (MoE), only a fraction of the parameters are used in each forward pass, so computation  2  parameters  sparsity, where sparsity is the fraction of experts active. On the other hand, CoT enables the model to perform far more flops of computation for each token of the answer that it is trying to compute. In fact, CoT has a nice property that it allows the model to use a variable amount of compute depending on the hardness of the problem. Latent Variable Modeling A classic idea in machine learning is to define a probabilistic model with a latent (hidden) variable z and a visible variable y, where y is given to our learning algorithm. Marginalizing (summing) over the possible values of the latent variable allows us to express a rich distribution over the visible variables, P(y)  sum_z sim P(z) P(y mid z). For example, we can model the distribution over math problems and solutions by letting x denote a problem statement, y be ground truth answer or proof, and z as a free-form thought process that leads to the proof. The marginal probability distribution to optimize would be P(y mid x)  sum_z sim p(zmid x) P(y mid x, z) The latent variable perspective is particularly useful for understanding methods that involve collecting multiple parallel CoTs or searching over the CoTthese algorithms can be seen as sampling from the posterior P(z mid x, y). This view also suggests the benefits of using the log loss log P(y mid x) as the target objective to optimize, as the log loss objective has been so effective in pretraining. Thinking in Tokens The strategy of generating intermediate steps before generating short answers, particularly for math problems, was explored by Ling, et al. 2017, who introduced the AQUA-RAT dataset, and then expanded by Cobbe et al. 2021, who introduced the Grade School Math (GSM) dataset. Cobbe et al. train a generator with supervised learning on human-written solutions and verifiers that predict the correctness of a candidate solution; they ..."}],"edges":[{"source":"node_14","target":"node_22","weight":0.9331283023125161}],"clusters":[{"id":0,"name":"The Attics","keywords":["the attics","shredded newspaper","dust","blowbecause","siding","the homes","rafters","a too-steep roof","the outside","the wall"],"articles":[0,1,16,17,27,32,41]},{"id":1,"name":"Stories","keywords":["stories","One Great Story","a conversation","a better conversationalist","words","rhetorical skills","his typically brief missives","how shed love","the literary tour","his grammar"],"articles":[7,13,20,29,30,33,37,40,42,44]},{"id":2,"name":"The Writings","keywords":["the writings","the Columbia Journalism Review","readers","the Wall Street Journal","The mid-century American cartoonist Don Wright","The Eighteenth Brumaire","historical materialism","literacy","the financial press","class Eric Timothy Carlson Marxist bros"],"articles":[2,5,6,9,14,15,18,19,22,25,28,31,38]},{"id":3,"name":"My Private Life","keywords":["My Private Life","each other racist","the information","An age","our classroom","fifth grade","The classroom","the walls","the Age","my class"],"articles":[11,12,26,36,46]},{"id":4,"name":"Weblog Subscribe Claude Skills","keywords":["Weblog Subscribe Claude Skills","their new code interpreter feature","the slack-gif-creator skill Skills","Claudes new document creation abilities","their models","specialized tasks","resources","all available skill files","a coding environment","a skill"],"articles":[3,4,8,10,21,23,24,34,35,39,43,45,47]}],"metadata":{"clustering_method":"kmeans","n_clusters":5,"total_articles":48},"created_at":"2025-11-07T21:10:23.059639"}